[
  {
    "id": 1,
    "BrandName": "Pizza Hut",
    "CampaignTitle": "Your Mood, Your pizza",
    "CampaignVideo": "https://youtu.be/pwe1Piu4eps",
    "Objective": "The objective of the Pizza Hut campaign featuring Shah Rukh Khan and Disha Patani is to promote the brand's diverse range of pizzas and highlight how they can cater to different moods and cravings. The campaign aims to create a connection between the brand and the target audience by showcasing relatable situations and offering suitable pizza recommendations.",
    "Strategy": "The Pizza Hut campaign employs several strategies to achieve its objective.",
    "CelebrityEndorsement": "By featuring popular actors Shah Rukh Khan and Disha Patani, the campaign leverages their star power and influence to create brand awareness and credibility. Their involvement helps to capture the attention of the target audience and generate interest in the campaign.",
    "EmotionBasedMarketing": "The campaign focuses on different moods and emotions experienced by the characters portrayed by Shah Rukh Khan and Disha Patani. By associating specific pizzas with these emotions, Pizza Hut aims to create a relatable connection with the audience. This strategy taps into the idea that food choices can be influenced by one's mood and cravings.",
    "PersonalizedRecommendations": "The attentive server in the films plays a key role by responding to the characters' moods and cravings with personalized pizza recommendations. This strategy emphasizes Pizza Hut's ability to cater to individual preferences and create a customized dining experience. It also showcases the knowledge and expertise of the Pizza Hut staff in suggesting the perfect pizza to satisfy customers' desires.",
    "CulinaryExperienceAndIndulgence": "The campaign highlights the experience of indulging in Pizza Hut's diverse range of pizzas. By associating specific pizzas with experiences like feeling like a king or enjoying a romantic moment, the campaign aims to evoke emotions and create a desire for the showcased pizza offerings. It emphasizes the pleasure and satisfaction derived from enjoying Pizza Hut's culinary creations.",
    "InfluencersInvolved": "Saif ali khan, Shehnaz gill",
    "IndustryType": "Fast Food chain",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Product Promotion",
    "LaunchTimelines": "April 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/actorsaifalikhan, https://app.qoruz.com/profile/shehnaazgill",
    "URL": "/images/Influencer-Campaign/BrandLogos/Pizza_Hut_jgad0t.png",
    "PageURL": "your-mood-your-pizza",
    "BrandURL": "pizza-hut"
  },
  {
    "id": 2,
    "BrandName": "Godrej appliance",
    "CampaignTitle": "Introducing India's first leakproof AC",
    "CampaignVideo": "https://youtu.be/zd-wG_WykVI",
    "Objective": "The objective of Godrej Appliances' campaign featuring Ayushmann Khurrana is to promote the brand's innovative solution, the Godrej Leak-proof AC with Anti-Leak Technology, and position it as the ultimate solution to the frustration caused by leaking air conditioners. The campaign aims to create awareness about the product's unique features and benefits, generate interest among consumers, and drive sales.",
    "Strategy": "The Godrej Appliances campaign employs several strategies to achieve its objective.",
    "FrustrationToSolutionNarrative": "The campaign cleverly showcases the frustration experienced by customers due to leaking air conditioners, highlighting a common problem faced by many. By presenting Ayushmann Khurrana's humorous and makeshift fix using a diaper, the campaign captures attention and creates an engaging narrative. This strategy helps to build anticipation for a more advanced and efficient solution, creating a desire for the showcased Godrej Leak-proof AC.",
    "IntroductionOfAntiLeakTechnology": "The campaign introduces and emphasizes the unique selling proposition of the Godrej Leak-proof AC, which is its Anti-Leak Technology. By showcasing Ayushmann Khurrana's exasperation with the leaking air conditioner and his subsequent discovery of the Godrej Leak-proof AC, the campaign positions the product as an innovative solution to the problem.",
    "HumorAndRelatability": "The use of humor in the campaign, particularly Ayushmann Khurrana's improvised fix using a diaper, adds an element of entertainment and relatability. Humor helps to capture the audience's attention, create a memorable experience, and make the message more engaging.",
    "CelebrityEndorsement": "The campaign features Ayushmann Khurrana, a popular and relatable actor known for his versatile performances. By leveraging his star power and likeability, the campaign aims to enhance brand recall, credibility, and appeal among the target audience.",
    "ProductPresentationAndDemonstration": "The TV commercial transitions to Ayushmann Khurrana presenting the Godrej Leak-proof AC as the ultimate solution. This strategy showcases the product's features and benefits, highlighting its advanced technology and reliability. By presenting the product as the answer to the problem introduced earlier in the narrative, the campaign aims to create a strong desire among consumers to choose the Godrej Leak-proof AC for their cooling needs.",
    "InfluencersInvolved": "Ayushmann Khurrana ",
    "IndustryType": "Appliance company",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Product Launch",
    "LaunchTimelines": "April 2023",
    "AgencyName": "Creativeland Aisa",
    "QoruzProfileLink": "https://app.qoruz.com/profile/ayushmannk",
    "URL": "/images/Influencer-Campaign/BrandLogos/Godrej_Appliances_gnopig.jpg",
    "PageURL": "introducing-indias-first-leakproof-ac",
    "BrandURL": "godrej-appliance"
  },
  {
    "id": 3,
    "BrandName": "Capri loans",
    "CampaignTitle": "Baat Sapno Ki Hai",
    "CampaignVideo": "https://youtu.be/m3gOy3cH2Qk",
    "Objective": "The objective of the 'Baat Sapno Ki Hai' campaign by Capri Loans is to promote their financial offerings by associating them with the dreams and aspirations of the target audience. The campaign aims to create an emotional connection with potential customers and position Capri Loans as a supportive financial partner in achieving their dreams.",
    "Strategy": "",
    "EmotionalAppeal": "The campaign focuses on evoking emotions and aspirations by featuring popular cricketers like Hardik Pandya, Kane Williamson, and Shubman Gill making them relatable role models for the target audience.",
    "DreamCentricMessaging": "The tagline 'Baat Sapno Ki Hai' (It's all about dreams) emphasizes the importance of dreams and positions Capri Loans as a brand that understands the value of aspirations. The messaging highlights that while dreams are priceless, having a little financial help can make a significant difference in achieving them.",
    "ShowcasingFinancialOfferings": "The campaign subtly showcases Capri Loans' financial offerings without overwhelming the central theme of dreams. It highlights the idea that Capri Loans can be the supportive partner that helps individuals realize their dreams by providing the necessary financial assistance when needed.",
    "InfluencersInvolved": "Hardik Pandya, Shubham Gill, Kane Williamson",
    "IndustryType": "Finance Company",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "April 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/hardikpandya93, https://app.qoruz.com/profile/RealShubmanGill, ",
    "BrandURL":"capri-loans",
    "URL": "/images/Influencer-Campaign/BrandLogos/Capri_Loans_caamfe.jpg",
    "PageURL": "baat-sapno-ki-hai"
  },
  {
    "id": 4,
    "BrandName": "The Oberoi",
    "CampaignTitle": "#TasteOfMumbai",
    "CampaignVideo": "https://youtu.be/5dLVzKR2wug",
    "Objective": "The objective of the campaign for The Oberoi, Mumbai is to communicate the launch of the Taste of Mumbai Tiffin, curated by Michelin star Chef Vineet Bhatia at their restaurant Ziya. The campaign aims to create awareness about this innovative approach to fine dining and generate excitement among food enthusiasts and potential customers. Additionally, the campaign seeks to attract media attention and coverage in top publications in the industry.",
    "Strategy": "",
    "InnovativeConcept": "The campaign focuses on the unique concept of the Taste of Mumbai Tiffin, which collects flavors from various communities of Mumbai and presents them in an elegant tiffin. By highlighting the collection of diverse flavors and the expertise of Michelin star Chef Vineet Bhatia, the campaign positions the restaurant as a destination for an extraordinary culinary experience.",
    "EditorialStyleVisuals": "The campaign utilizes a colorful editorial-style approach in its visuals. The visuals not only highlight the tiffin packed with flavors but also incorporate the essence of the city's diverse communities and their culinary traditions.",
    "SocialMediaPresence": "The campaign leverages Instagram to reach a wider audience and generate impressions. With 71,000 impressions on Instagram, the campaign successfully captures attention and engages with the target audience. By utilizing the platform's visual nature, the campaign showcases the vibrant visuals and encourages user engagement through likes, shares, and comments.",
    "MediaOutreach": "By targeting relevant food and lifestyle publications, the campaign seeks to position The Oberoi, Mumbai and the Taste of Mumbai Tiffin as noteworthy and newsworthy topics. This strategy helps to increase brand visibility, attract food enthusiasts, and build credibility for the culinary offerings of the restaurant.",
    "InfluencersInvolved": "Chef Vineet",
    "IndustryType": "Food",
    "AssetType": "Video",
    "SocialPlatforms": "Instagram, Youtube",
    "CampaignObjective": "Product Launch",
    "LaunchTimelines": "July 2019",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/Vineet_Bhatia",    
    "URL": "/images/Influencer-Campaign/BrandLogos/The_Oberoi_yxia5m.png",
    "PageURL": "tasteofmumbai",
    "BrandURL": "the-oberoi"
  },
  {
    "id": 5,
    "BrandName": "AU Small Finance Bank",
    "CampaignTitle": "#BadlaavHumseHai",
    "CampaignVideo": "https://youtu.be/vSLTiHDKwlg",
    "Objective": "The objective of the 'Badlaav Humse Hai' campaign for AU Bank is to create a perception of a shift in the banking system, emphasizing freedom from old customs and highlighting AU Bank's advanced banking features. The campaign aims to raise awareness among existing and potential customers about the bank's innovative services and offerings.",
    "Strategy": "",
    "SymbolismAndAssociation": "The campaign utilizes symbolism to associate AU Bank's message with a day of freedom and national importance. By drawing a parallel between the shift in the banking system and significant historical events, the campaign creates an emotional connection with the audience.",
    "CustomerCentricApproach": "The campaign's genesis from AU Bank's expanding customer base highlights the importance of customers in shaping the bank's services and offerings.",
    "SpreadOfWord": "The campaign series focuses on spreading the word about AU Bank's advanced banking features. It aims to leverage various marketing channels, including digital platforms, social media, and traditional advertising, to reach a wide audience. By creating engaging and informative content, the campaign aims to generate buzz and curiosity, encouraging customers to explore AU Bank's offerings.",
    "MessagingAndStorytelling": "The campaign utilizes persuasive messaging and storytelling techniques to effectively communicate the benefits and advantages of AU Bank's advanced banking features. By highlighting real-life scenarios and showcasing the positive impact of the bank's services, the campaign aims to connect with customers on an emotional level and motivate them to switch to AU Bank.",
    "InfluencersInvolved": "Aamir khan, kiara Advani",
    "IndustryType": "Finance",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Perception Change Brand Awareness",
    "LaunchTimelines": "April 2022",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/aamir_khan , https://app.qoruz.com/profile/kiaraaliaadvani",
    "URL": "/images/Influencer-Campaign/BrandLogos/AU_Small_Finance_Bank_gh4wss.png",
    "PageURL": "badlaavhumsehai",
    "BrandURL": "au-small-finance-bank"
  },
  {
    "id": 6,
    "BrandName": "BharatPe",
    "CampaignTitle": "#TeamBharatPe",
    "CampaignVideo": "https://youtu.be/L0EkNm8CF1Y",
    "Objective": "The objective of the campaign is to extend and strengthen the brand's association with Indian culture and heritage, emphasizing its 'Indian-ness' and connection to the nation. The campaign aims to enhance brand recognition, build a sense of pride and loyalty among the target audience, and position the brand as a symbol of Indian identity.",
    "Strategy": "",
    "CulturalStorytelling": "The campaign utilizes storytelling techniques to highlight the brand's connection to Indian culture and heritage. It showcases narratives that resonate with the target audience, emphasizing the brand's values, traditions, and the richness of Indian heritage. ",
    "VisualRepresentation": "By incorporating the name \"Bharat\" and deriving the visual identity from the tri-color of the Indian flag, the campaign creates a strong visual association with Indian nationalism.",
    "CulturalEventsAndPartnerships": "The campaign leverages cultural events and partnerships to further strengthen the brand's association with Indian-ness. It may involve sponsoring or participating in cultural festivals, collaborating with local artists or artisans, or supporting initiatives that promote Indian heritage. These activities help to create meaningful connections with the target audience and demonstrate the brand's commitment to preserving and promoting Indian culture.",
    "InfluencersInvolved": "K L Rahul, Rohit Sharma",
    "IndustryType": "Fintech",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Recognition",
    "LaunchTimelines": "August 2021",
    "AgencyName": "",
    "QoruzProfileLink": " , https://app.qoruz.com/profile/ImRo45?search_id=1684917754",
    "URL": "/images/Influencer-Campaign/BrandLogos/Bharatpe_zvmfti.png",
    "PageURL": "teambharatpe",
    "BrandURL": "bharatpe"
  },
  {
    "id": 7,
    "BrandName": "Bajaj Almond Drop Hair Oil",
    "CampaignTitle": "#DaroNahiDareKaro #Style Fearlessly",
    "CampaignVideo": "https://youtu.be/-vI_7cJh9So",
    "Objective": "The objective of the campaign is to encourage women to \"Style Fearlessly\" by addressing their concerns about hair fall and presenting Bajaj Almond Drops Hair Oil as a trustworthy solution. The campaign aims to overcome the reluctance of women to try new hairstyles due to fears of hair fall, highlighting the benefits of using Bajaj Almond Drops Hair Oil, such as its nourishment and effectiveness in reducing hair fall.",
    "Strategy": "",
    "AddressingConsumerConcerns": "The campaign acknowledges the common fear among women regarding hair fall when trying new hairstyles.",
    "HighlightingProductBenefits": "The campaign emphasizes the nourishing properties of Bajaj Almond Drops Hair Oil, which contains 6X Vitamin E and almonds.",
    "ClinicalProof": "The campaign leverages clinical proof to establish the efficacy of Bajaj Almond Drops Hair Oil. By stating that it is twice as effective in reducing hair fall compared to other brands, the campaign adds credibility and reinforces the trustworthiness of the product.",
    "EmphasizingFearlessnessAndSelfExpression": "The campaign's tagline, 'Styling Fearlessly,' encourages women to embrace their personal style and experiment with different hairstyles. By associating Bajaj Almond Drops Hair Oil with this fearless approach, the campaign aims to inspire confidence and dispel concerns about hair fall, positioning the product as an enabler of self-expression.",
    "VisualStorytelling": "The campaign can utilize visuals to showcase women confidently styling their hair and trying different hairstyles without worry. These visuals can depict the diverse range of hairstyles and the positive impact of using Bajaj Almond Drops Hair Oil on hair health, reinforcing the message of fearlessness and trust in the product.",
    "InfluencersInvolved": "Kiara Advani",
    "IndustryType": "Hair Care",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "March 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/kiaraaliaadvani",
    "URL": "/images/Influencer-Campaign/BrandLogos/Bajaj_Almond_Drops_l1wpim.png",
    "PageURL": "daronahidarekaro-style-fearlessly",
    "BrandURL": "bajaj-almond-drop-hair-oil"
  },
  {
    "id": 8,
    "BrandName": "Metro",
    "CampaignTitle": "#MyPair",
    "CampaignVideo": "https://youtu.be/LfL2tQrXOrM",
    "Objective": "The objective of the campaign is to promote Metro Shoes' new collection featuring Siddharth Malhotra and Katrina Kaif and reinforce the brand's ethos of providing finest quality, innovative designs, comfort, and value for money. The campaign aims to resonate with the target audience and build trust, loyalty, and brand recognition while showcasing the collection's trendiness and ease of wear.",
    "Strategy": "",
    "CelebrityEndorsement": "By featuring popular actors Siddharth Malhotra and Katrina Kaif, who resonate with the brand's ethos, the campaign leverages their star power and influence to attract attention and create a strong association between the celebrities and the collection. ",
    "EmphasizingBrandHeritage": "The campaign highlights Metro Shoes' legacy since 1947 and its reputation for providing finest quality and innovative designs.",
    "ComfortAndStyle": "The campaign communicates Metro Shoes' focus on offering comfortable footwear without compromising on style. It emphasizes that the new collection is designed to be trendy and easy to wear, allowing customers to create fashionable looks effortlessly.",
    "SocialMediaIntegration": "Recognizing the importance of fast fashion and the desire to share looks on social media, the campaign highlights that the new collection is designed for easy-to-wear and easy-to-click looks.",
    "ValueForMoney": "The campaign emphasizes Metro Shoes' commitment to offering the best in terms of comfort and affordability. By highlighting the collection's pocket-friendly prices, the campaign appeals to price-conscious consumers who seek quality footwear at a reasonable cost.",
    "InfluencersInvolved": "Katrina Kaif, Siddharth Malhotra",
    "IndustryType": "Fashion",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "August 2018",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/katrinakaif?search_id=1684917754, https://app.qoruz.com/profile/S1dharthM?search_id=1684917754",
    "URL": "/images/Influencer-Campaign/BrandLogos/Metro_omocg5.jpg",
    "PageURL": "mypair",
    "BrandURL": "metro"
  },
  {
    "id": 9,
    "BrandName": "CoinSwitch",
    "CampaignTitle": "Kuch Toh Badlega",
    "CampaignVideo": "https://www.youtube.com/watch?v=oQizW6pRTp8",
    "Objective": "The objective of Coinswitch Kuber's association with Ranveer Singh as its brand ambassador is to leverage his mass appeal, popularity among Gen Z and millennial customers, and influence to increase brand awareness, attract new users, and establish a positive brand image in the cryptocurrency space. The objective is also to align Ranveer Singh's persona with the brand's ongoing 'Kuch Toh Badlega' campaign, which aims to communicate the transformative potential of entering the crypto world.",
    "Strategy": "",
    "CelebrityEndorsement": "By partnering with Bollywood actor Ranveer Singh, who is a youth icon and has a strong following among Gen Z and millennials, Coinswitch Kuber aims to leverage his mass appeal and popularity to increase brand recognition and credibility.",
    "CommunicatingTransformativePotential": "The 'Kuch Toh Badlega' campaign revolves around the idea that entering the crypto world can bring about positive change and transformation. By featuring Ranveer Singh in ad films that showcase this concept, Coinswitch Kuber aims to inspire and educate viewers about the potential of cryptocurrencies and how they can be a part of something bigger.",
    "TargetingGenZAndMillennials": "Coinswitch Kuber recognizes the importance of targeting Gen Z and millennials, who are a key demographic in the cryptocurrency space. By associating with Ranveer Singh, who has a strong fan base among this audience, the campaign aims to resonate with their interests, aspirations, and desire for change and innovation.",
    "InfluencersInvolved": "Ranveer Singh",
    "IndustryType": "Fintech",
    "AssetType": "Video",
    "SocialPlatforms": "TV, Digital , YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "October 2021",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/RanveerOfficial?search_id=1684917754",
    "URL": "/images/Influencer-Campaign/BrandLogos/Coinswitch_nj3xqm.png",
    "PageURL": "kuch-toh-badlega",
    "BrandURL": "coinswitch"
  },
  {
    "id": 10,
    "BrandName": "Chumbak",
    "CampaignTitle": "#withchumbak",
    "CampaignVideo": "https://youtu.be/Lm6pDwYMDrU",
    "Objective": "The objective of Chumbak's celebrity brand campaign featuring Sara Ali Khan is to create brand awareness, increase brand affinity, and attract new customers. The campaign aims to leverage Sara Ali Khan's popularity and influence among the target audience to enhance the brand's reach and establish a stronger connection with consumers.",
    "Strategy": "The campaign employs a storytelling strategy to engage the audience and create a relatable narrative around Sara Ali Khan moving into a Chumbak home.",
    "CelebrityEndorsement": "By featuring Sara Ali Khan, a popular Bollywood celebrity, as the face of the campaign, Chumbak aims to leverage her star power and fan base to generate attention and interest in the brand.",
    "StorytellingApproach": "The campaign unfolds a story through a series of three films, showcasing a day in the life of Sara Ali Khan after she moves in #WithChumbak.",
    "RelatabilityAndAspirationalLifestyle": "The campaign aims to strike a balance between relatability and an aspirational lifestyle. By depicting Sara Ali Khan's experience of moving into a Chumbak home, the campaign appeals to consumers who desire a stylish and vibrant living environment.",
    "BrandIntegration": "Throughout the campaign, Chumbak's products and designs are seamlessly integrated into Sara Ali Khan's life in the Chumbak home. This integration serves to highlight the brand's diverse product range and its ability to enhance personal spaces with its distinctive style.",
    "InfluencersInvolved": "Sara Ali Khan",
    "IndustryType": "Home Decor",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "January 2021",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/iSaraAliKhan?search_id=1684917754",
    "URL": "/images/Influencer-Campaign/BrandLogos/Chumbak_ifw5tu.png",
    "PageURL": "withchumbak",
    "BrandURL": "chumbak"
  },
  {
    "id": 11,
    "BrandName": "Vedantu",
    "CampaignTitle": "#Vedantu #TheScriptRoom",
    "CampaignVideo": "https://youtu.be/CqrJx8LLiTA",
    "Objective": "The objective of the campaign is to showcase how Vedantu teachers inspire and impact their students' lives, highlighting the importance of a teacher's responsibility in nurturing students and instilling life lessons beyond academic achievements. The campaign aims to create awareness about Vedantu's approach to education and its focus on holistic development.",
    "Strategy": "",
    "RealLifeStories": "The campaign focuses on real-life stories of students and teachers to create an emotional connection with the audience. By featuring authentic narratives, the campaign aims to demonstrate the genuine impact and inspiration that Vedantu teachers have on their students.",
    "CelebrityEndorsement": "The campaign leverages the popularity and credibility of Aamir Khan as Vedantu's brand ambassador.",
    "EmphasisOnLifeLessons": "The campaign emphasizes the importance of life lessons such as kindness, love, and trust that Vedantu teachers impart to their students.",
    "RemoteLearningAspect": "The campaign emphasizes that Vedantu's teachers can impact students' lives regardless of the physical distance between them. This highlights the convenience and effectiveness of Vedantu's online learning platform, showcasing how technology can bridge the gap between teachers and students.",
    "EmotionalStorytelling": "The campaign utilizes storytelling techniques to evoke emotions and create a memorable connection with the audience. By presenting heartfelt and relatable stories, the campaign aims to inspire viewers and reinforce the idea of the profound influence teachers can have on their students.",
    "InfluencersInvolved": "Aamir Khan",
    "IndustryType": "Edutech",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "March 2021",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/aamir_khan?search_id=1684917754",
    "URL": "/images/Influencer-Campaign/BrandLogos/Vedantu_l1c5mo.png",
    "PageURL": "vedantu-thescriptroom",
    "BrandURL": "vedantu"
  },
  {
    "id": 12,
    "BrandName": "PhonePe",
    "CampaignTitle": "#PhonePe Auto Insurance",
    "CampaignVideo": "https://www.youtube.com/watch?v=iroE8ZGnzmc",
    "Objective": "The objective of PhonePe's campaign featuring Aamir Khan and Alia Bhatt is to create awareness and promote the ease of buying insurance on the platform. The campaign aims to educate customers about the benefits of being prepared for unforeseen circumstances through insurance and highlight PhonePe's instant, paperless, and mobile-first insurance buying process.",
    "Strategy": "",
    "CelebrityEndorsement": "PhonePe leverages the popularity and influence of actors Aamir Khan and Alia Bhatt to attract attention and enhance brand credibility.",
    "HighlightingEaseAndAccessibility": "The campaign emphasizes the convenience and accessibility of buying insurance on the PhonePe app. By showcasing the instant, paperless, and mobile-first nature of the insurance buying process, the campaign aims to position PhonePe as a user-friendly platform that simplifies insurance purchase for customers.",
    "EducationOnInsuranceOptions": "The campaign educates customers about the availability of different insurance plans on the PhonePe app, including bike, car, life, and health insurance. By providing information about the range of insurance options, the campaign aims to encourage customers to explore and consider insurance as a means to stay prepared for unexpected events.",
    "InfluencersInvolved": "Alia Bhatt, Amir Khan",
    "IndustryType": "Fintech",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube, Hotstar",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "October 2021",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/aamir_khan?search_id=1684917754, https://app.qoruz.com/profile/aliaa08?search_id=1684917754",
    "URL": "/images/Influencer-Campaign/BrandLogos/PhonePe_rbnjlp.png",
    "PageURL": "phonepe-auto-insurance",
    "BrandURL": "phonepe"
  },
  {
    "id": 13,
    "BrandName": "Limca",
    "CampaignTitle": "#sab nichord le",
    "CampaignVideo": "https://youtu.be/_Qr8Wyt7GRw",
    "Objective": "The objective of the campaign is to promote the brand's core philosophy of embracing a vibrant and fulfilling life. It aims to inspire individuals, especially the youth, to seize every opportunity and extract the maximum joy and satisfaction from their experiences. The campaign intends to convey the message of 'sab nichord le,' which encourages people to make the most of life's moments.",
    "Strategy": "By featuring Jeetu Bhaiya in the TVC, the campaign appeals to the youth who are familiar with his popular character. His charisma and relatability help in connecting with the target audience and effectively conveying the brand's message.",
    "HighlightingEnergyAndPositivity": "The ad is designed to be filled with energy and positivity, reflecting the brand's refreshing and light tone.",
    "EmphasizingTheBrandValues": "The campaign captures the essence of freshness, replenishment, and hydration that are associated with the Limca brand.",
    "InfluencersInvolved": "Jeetu Bhai",
    "IndustryType": "Food & Beverage",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "January 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/jitendrak1?search_id=1684917754",
    "URL": "/images/Influencer-Campaign/BrandLogos/Limca_rdhjzg.png",
    "PageURL": "sab-nichord-le",
    "BrandURL": "limca"
  },
  {
    "id": 15,
    "BrandName": "Toothsi",
    "CampaignTitle": "#easypeasytoothsi",
    "CampaignVideo": "https://youtu.be/Ds0scQSVFRE",
    "Objective": "The objective of the campaign is to raise awareness about toothsi by makeO's clear aligners and promote the ease of correcting teeth misalignment. The campaign aims to position toothsi by makeO as an affordable and convenient solution for achieving a perfect smile.",
    "Strategy": "The strategy for the campaign revolves around leveraging the popularity and influence of brand ambassadors Virat Kohli and Anushka Sharma to reach a wide audience and generate interest in teeth alignment. The campaign will focus on showcasing the simplicity and affordability of toothsi by makeO's clear aligners through a playful and engaging advertisement. It will emphasize the accessibility of the brand's services and highlight the ease of booking appointments and using the aligners. The campaign will utilize various channels, including television, digital platforms, and social media, to maximize reach and engage with the target audience effectively.",
    "InfluencersInvolved": "Virat Kohli, Anushka Sharma",
    "IndustryType": "Personal Care",
    "AssetType": "Video",
    "SocialPlatforms": "Instagram, YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "December 2022",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/imVkohli?search_id=1684917754 , https://app.qoruz.com/profile/AnushkaSharma?search_id=1684917754",
    "URL": "/images/Influencer-Campaign/BrandLogos/Toothsi_kslxvi.jpg",
    "PageURL": "easypeasytoothsi",
    "BrandURL": "toothsi"
  },
  {
    "id": 16,
    "BrandName": "Swiggy",
    "CampaignTitle": "#SwiggyInstamart",
    "CampaignVideo": "https://youtu.be/5T3VXMHsMbo",
    "Objective": "The objective of the campaign is to promote Swiggy's Instamart as the go-to platform for affordable grocery purchases in southern cities. The campaign aims to build a strong brand connection and affinity with customers in the region by showcasing relatable and localized nuances of everyday life in Tamil, Kannada, Telugu, and Malayali households.",
    "Strategy": "The strategy for the campaign revolves around leveraging cultural insights unique to the southern region to resonate with the target audience. The ads feature a mix of 30-second TV spots that reframe ordinary banter in southern households, highlighting the couple's healthy disses and showcasing how Instamart offers affordable prices for weekly and monthly grocery purchases. By pairing these relatable situations with Swiggy's characteristic subtle humor, the campaign aims to engage customers and drive home the message of purchasing groceries at an affordable cost on Instamart. The use of local languages and cultural nuances helps to establish a strong connection with the target audience and position Instamart as a convenient and cost-effective solution for their grocery needs. The campaign will be promoted through various channels to maximize reach and generate brand affinity among customers in the southern cities.",
    "InfluencersInvolved": "Madhavan",
    "IndustryType": "Online food ordering",
    "AssetType": "Video",
    "SocialPlatforms": "Instagram, YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "November 2022",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/ActorMadhavan?search_id=1684917754",
    "URL": "/images/Influencer-Campaign/BrandLogos/Swiggy_wubsfn.png",
    "PageURL": "swiggyinstamart",
    "BrandURL": "swiggy"
  },
  {
    "id": 17,
    "BrandName": "Balaji Wafers",
    "CampaignTitle": "#waferszyaadaflavourswahwah",
    "CampaignVideo": "https://youtu.be/UgYWRRAT2m4",
    "Objective": "The campaign revolves around the idea that a packet of Balaji Wafers not only has more quantity but also a variety of flavours that are tastier and hence positioning. The ad campaign comprises a series of 3 films conceptualized and executed by Publicis Beehive and they have been shot by production house.",
    "Strategy": "",
    "HighlightTheQuantityAndVariety": "The campaign should emphasize the larger quantity of wafers in a packet compared to competitors, as well as the wide range of delicious flavors available. This strategy will target consumers who value both quantity and variety in their snack choices.",
    "FocusOnTasteAndQuality": "The campaign should showcase the superior taste and quality of Balaji Wafers, highlighting the brand's commitment to using high-quality ingredients and production processes.",
    "EngageWithStorytelling": "The series of three films should use storytelling techniques to engage the audience and create a connection with the brand. The films can showcase relatable situations where Balaji Wafers become the preferred choice due to their quantity, variety, and superior taste.",
    "LeverageDigitalPlatforms": "The campaign should have a strong presence on digital platforms, such as social media and video-sharing platforms, to reach a wide audience and generate buzz.",
    "InfluencersInvolved": "Ayushmann Khurrana",
    "IndustryType": "Food",
    "AssetType": "Video",
    "SocialPlatforms": "Instagram, YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "December 2019",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/ayushmannk",
    "URL": "/images/Influencer-Campaign/BrandLogos/Balaji_Wafers_q1prcs.png",
    "PageURL": "waferszyaadaflavourswahwah",
    "BrandURL": "Balaji Wafers"
  },
  {
    "id": 18,
    "BrandName": "Lenskart",
    "CampaignTitle": "#HowToILook",
    "CampaignVideo": "https://www.youtube.com/watch?v=-kjmMBfqEW0",
    "Objective": "The objective of Lenskart's new campaign is to create awareness and promote the accessibility of high-quality, stylish glasses to every Indian at affordable prices. Additionally, the campaign aims to educate and emphasize the importance of protecting eyes from harmful electronic screen radiation.",
    "Strategy": "The campaign takes a unique approach in the eyewear category by deviating from traditional conventions. It showcases not only the product but also its usage occasions, highlighting the versatility and style of Lenskart glasses. The campaign leverages a celebrity endorsement to enhance brand credibility and visibility. The endorsement also focuses on promoting the Blu Lenses, which are recommended for their ability to protect eyes from the harmful violet-blue spectrum emitted by electronic screens. By combining affordability, style, and eye protection, the campaign aims to resonate with the target audience and encourage them to choose Lenskart as their preferred eyewear brand.",
    "InfluencersInvolved": "Katrina Kaif",
    "IndustryType": "Prescription eyewear Opticians",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "October 2017",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/katrinakaif?search_id=1684917754",
    "URL": "/images/Influencer-Campaign/BrandLogos/Lenskart_uuhgnt.jpg",
    "PageURL": "howtoilook",
    "BrandURL": "lenskart"
  },
  {
    "id": 19,
    "BrandName": "Wakefit",
    "CampaignTitle": "‘Sleep India Sleep’",
    "CampaignVideo": "https://www.youtube.com/watch?v=-r5Kgcj_lm0",
    "Objective": "The objective of the Wakefit campaign is to create awareness and educate consumers about sleep health and its importance in the modern context. The campaign aims to strengthen the brand identity of Wakefit across multiple regions in the country and build affinity with its target audience.",
    "Strategy": "The strategy of the Wakefit campaign is to leverage the influence of Ayushmann Khurrana to create awareness and educate consumers about sleep health. The campaign will focus on the target audience's persona of being progressive yet practical in their lifestyle and purchase decisions. By highlighting the importance of sleep health in the modern context, the campaign aims to position Wakefit as a trusted and reliable brand in the minds of consumers. The campaign will also leverage social media and digital platforms to amplify the reach and impact of the message, targeting audiences across multiple regions in the country.",
    "InfluencersInvolved": "Ayushmann Khurrana",
    "IndustryType": "Home & Decor",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "4 May 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/ayushmannk",
    "URL": "/images/Influencer-Campaign/BrandLogos/Wakefit_rpt7yh.jpg",
    "PageURL": "sleep-india-sleep",
    "BrandURL": "wakefit"
  },
  {
    "id": 20,
    "BrandName": "Reebok",
    "CampaignTitle": "‘I am the New’",
    "CampaignVideo": "https://www.youtube.com/watch?v=Z6az_ZFqHkc",
    "Objective": "The objective of the Reebok campaign is to re.-establish the brand as a leading sports and performance brand in India and inspire audiences to embrace fitness as a way of life. The campaign aims to deepen the brand's connection with the youth of India and drive growth for the Reebok brand.",
    "Strategy": "The strategy of the Reebok campaign is to encourage audiences to see the playground differently and embrace fitness as a way of life. The campaign aims to resonate deeply with audiences by inspiring and motivating them to push their limits and achieve their fitness goals. Reebok is leveraging social media and digital platforms to amplify the reach and impact of the campaign, targeting young and active audiences across the country. By positioning itself as a leading sports and performance brand and inspiring audiences to embrace fitness as a way of life.",
    "InfluencersInvolved": "Taapsee Pannu, Suryakumar Yadav",
    "IndustryType": "Fashion & lifestyle",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "5 May 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/taapsee ,https://app.qoruz.com/profile/surya_14kumar_1",
    "URL": "/images/Influencer-Campaign/BrandLogos/Reebok_hmgf8d.png",
    "PageURL": "i-am-the-new",
    "BrandURL": "reebok"
  },
  {
    "id": 21,
    "BrandName": "Gillette",
    "CampaignTitle": "Get Your MACH On!",
    "CampaignVideo": "https://www.youtube.com/watch?v=bLvrQ-ErOe0",
    "Objective": "The objective of the Gillette Mach3 campaign is to highlight the brand's cutting-edge technology and innovation and its role in delivering a superior grooming experience. The campaign aims to connect with the target audience by emphasizing the brand's cool and exciting vibe and its ability to enhance self-confidence and control.",
    "Strategy": "The strategy of the Gillette Mach3 campaign is to focus on the benefits of the brand's technology and innovation to deliver a superior grooming experience. The campaign will leverage the cool and exciting vibe of the brand's products to resonate with its target audience. Partnering with new-age cricketers who embody confidence and control will help strengthen the brand's image and connect with consumers who value looking their best.",
    "InfluencersInvolved": "Sanju Samson, Shreyas Iyer, Shubman Gill",
    "IndustryType": "Men's Beauty",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "3 September 2021",
    "AgencyName": "Grey Group",
    "QoruzProfileLink": "https://app.qoruz.com/profile/imsanjusamson,  https://app.qoruz.com/profile/shreyas41, https://app.qoruz.com/profile/RealShubmanGill?search_id=1684918937",
    "URL": "/images/Influencer-Campaign/BrandLogos/Gillette_itne1d.png",
    "PageURL": "get-your-mach-on",
    "BrandURL": "gillette"
  },
  {
    "id": 22,
    "BrandName": "TATA Starbucks",
    "CampaignTitle": "#ItStartsWithYourName",
    "CampaignVideo": "https://www.youtube.com/watch?v=YyKOc8M5w-s",
    "Objective": "The objective of the Tata Starbucks campaign is to emphasize the brand's customer-centric approach and highlight its ability to create a sense of belonging among its customers.",
    "Strategy": "The strategy of the Tata Starbucks campaign is to focus on personalized recognition of customers by their names, which is a key element of the Starbucks experience. The campaign aims to highlight the emotional connection that Starbucks creates with its customers and how it makes their visit meaningful. The 360-degree, integrated campaign includes a new brand film and a suite of marketing communication assets to ensure that the message reaches the target audience through various channels. By highlighting Starbucks' unique ability to create a sense of belonging, the campaign aims to strengthen the brand's relationship with its customers and attract new ones.",
    "InfluencersInvolved": "Actor Sia",
    "IndustryType": "Food & Beverages",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "11 May 2023",
    "AgencyName": "Edelman India",
    "QoruzProfileLink": "",
    "URL": "/images/Influencer-Campaign/BrandLogos/Starbucks_cavsod.png",
    "PageURL": "itstartswithyourname",
    "BrandURL": "tata-starbucks"
  },
  {
    "id": 24,
    "BrandName": "Hair & Care ( Marico )",
    "CampaignTitle": "‘Hair damage’ ",
    "CampaignVideo": "https://www.youtube.com/watch?v=w1fSTitDzYQ",
    "Objective": "The objective of the Hair & Care Hair Oil campaign is to promote the brand's new proposition of up to 100% damage repair and position the brand as a solution to the common hair damage problem faced by young girls due to heat, dust, and pollution.",
    "Strategy": "The strategy is to create a visually disruptive and quirky film and campaign that exaggerates the feeling of helplessness and frustration that one feels when trying to manage unmanageable, damaged hair. The campaign uses Rubal Shekhawat, a relatable representation of young girls who face hair damage problems, to showcase the effectiveness of the product in repairing hair damage. The campaign will be launched on TV and digital media in HSM & WB, followed by the brand's social media pages to reach a wider audience.",
    "InfluencersInvolved": "Rubal Shekhawat",
    "IndustryType": "FMCG",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Product Launch",
    "LaunchTimelines": "10 May 2023",
    "AgencyName": "Team WPP",
    "QoruzProfileLink": "https://app.qoruz.com/profile/rubal_shekhawat",
    "URL": "/images/Influencer-Campaign/BrandLogos/Hair___Care_vikbxq.png",
    "PageURL": "hair-damage",
    "BrandURL": "hair-care-marico"
  },
  {
    "id": 25,
    "BrandName": "The Moms Co. ",
    "CampaignTitle": "“For Every Mom, Through Every Change”",
    "CampaignVideo": "https://www.youtube.com/watch?v=W2JQTEwgnHU",
    "Objective": "The objective of The Moms Co.'s new campaign is to showcase their brand's values and commitment to natural ingredients and safety while highlighting their range of products that support women throughout their various life stages, including pregnancy and motherhood. The campaign will be launched on social media channels, specifically on YouTube and Instagram, which suggests that the strategy is to reach a wider audience through these popular platforms.",
    "Strategy": "The brand's strategy is to centered around emphasizing the importance of natural care and proof of performance, as well as promoting their understanding of the physical, emotional, and psychological changes that women go through during pregnancy and motherhood. By showcasing their commitment to natural ingredients, dermatologically tested products with no toxins and allergens, and the highest safety standards, they are positioning themselves as a trustworthy and reliable brand for women seeking safe and effective products during these life stages.",
    "InfluencersInvolved": "Sonam A. Kapoor",
    "IndustryType": "Beauty",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube, Instagram",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "9 May 2023",
    "AgencyName": "BBDO India",
    "QoruzProfileLink": "https://app.qoruz.com/profile/sonamakapoor",
    "URL": "/images/Influencer-Campaign/BrandLogos/The_Moms_Co._qdmhds.png",
    "PageURL": "for-every-mom-through-every-change",
    "BrandURL": "the-moms-co"
  },
  {
    "id": 26,
    "BrandName": "Pearson",
    "CampaignTitle": " #PrepareWell",
    "CampaignVideo": "https://www.youtube.com/watch?v=C2tnCRCNnPg",
    "Objective": "The objective of the company's campaign is to create a strong connection with students across the country by resonating with their spirit and driving intent at a deeper level. The company is working with other influencers to undertake a thematic storytelling approach, which suggests that the strategy is to create a more engaging and immersive experience for the target audience.",
    "Strategy": "The company's growth strategy appears to be centered around becoming a more consumer-centric company, building more meaningful and personal brand relationships with audiences, and ensuring that consumers are at the heart of everything they do. This suggests that the campaign's strategy is to create a more authentic and relatable communication that diffuses the hyperbole often seen in education advertising and keeps the campaign in a warm, believable, and genuine space, despite Vicky's celebrity presence.",
    "InfluencersInvolved": "Vicky Kaushal",
    "IndustryType": "Ed- Tech",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "9 April 2022",
    "AgencyName": "BITM",
    "QoruzProfileLink": "https://app.qoruz.com/profile/vickykaushal09",
    "URL": "/images/Influencer-Campaign/BrandLogos/Pearson_kwdfao.png",
    "PageURL": "preparewell",
    "BrandURL": "pearson"
  },
  {
    "id": 27,
    "BrandName": "Too Yumm ",
    "CampaignTitle": "‘Namkeen ke Shaukeen’",
    "CampaignVideo": "https://www.youtube.com/watch?v=Hl3NRa8jMCI",
    "Objective": "The objective of Too Yumm's new campaign seems to be to launch their new Namkeen range, which offers healthier snacking options without the use of Palm Oil, and create a significant impact in the lives of consumers. The campaign will feature Varun Dhawan's quirky and fun character to personify the brand's unconventional offerings and pep up their consumers, which suggests that the strategy is to create a more engaging and relatable communication with the target audience.",
    "Strategy": "The company's mission to create meaningful innovations for their consumers aligns with the strategy of launching a new Namkeen portfolio that offers guilt-free snacking options without compromising on taste. This suggests that the campaign's strategy is to position the brand as a healthier and purpose-driven alternative to traditional snack options, disrupting the snacking space with innovative products. The digital-first approach of the campaign and the strong Influencer leg also suggest that the strategy is to create better awareness and engagement among consumers by leveraging the reach and influence of digital media and influencers.",
    "InfluencersInvolved": "Varun Dhawan",
    "IndustryType": "FMCG",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Product Launch",
    "LaunchTimelines": "9 May 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/VarunDhawan.co",
    "URL": "/images/Influencer-Campaign/BrandLogos/Too_Yumm_gmf9nl.png",
    "PageURL": "namkeen-ke-shaukeen",
    "BrandURL": "too-yumm"
  },
  {
    "id": 29,
    "BrandName": "Bisleri",
    "CampaignTitle": "#CarryYourGame",
    "CampaignVideo": "https://www.youtube.com/watch?v=wK8ZsFH7jP8",
    "Objective": "The objective of the Bisleri #CarryYourGame campaign is to create a strong connection between hydration and sports and highlight the importance of water in peak human performance. The campaign aims to inspire the youth to stay hydrated and carry their best game forward in all aspects of life.",
    "Strategy": "Bisleri is using a digital campaign featuring award-winning athletes to showcase the importance of hydration for peak performance. They are focusing on the Bisleri 500 ml pack as the ultimate hydration partner. The campaign will be amplified through associations with leading marathons, athletic associations, cricket partnerships, and notable sporting events. Bisleri has also launched limited-edition bottles of the #CarryYourGame campaign showcasing famous cricketers from different teams. The campaign will be promoted through multiple touchpoints, including digital content, Out-of-Home media, delivery truck branding, radio contests, OTT platforms, in-stadium vending, and branding. The strategy aims to provide an exciting experience to the consumers and promote the brand as a reliable hydration partner for athletes and sports enthusiasts.",
    "InfluencersInvolved": "Lovlina Borgohain, Manpreet Singh, Ashwini Ponappa, Nishad Kumar.  ",
    "IndustryType": "FMCG",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "4 May 2023",
    "AgencyName": "82.5 Communications",
    "QoruzProfileLink": "https://app.qoruz.com/profile/lovlina_borgohain, https://app.qoruz.com/profile/manpreetpawar0, https://app.qoruz.com/profile/P9Ashwini7",
    "URL": "/images/Influencer-Campaign/BrandLogos/Bisleri_xr4yp6.png",
    "PageURL": "carryyourgame",
    "BrandURL": "bisleri"
  },
  {
    "id": 30,
    "BrandName": "Beardo",
    "CampaignTitle": "#Embrace the Tsunami Within.",
    "CampaignVideo": "https://www.youtube.com/watch?v=d1NMegoAy6Y",
    "Objective": "The objective of the campaign is to promote the launch of the new fragrance called Tsunami and establish it as a unique and powerful scent that embodies the strength and tenacity of the storm.",
    "Strategy": "The strategy of the campaign is to leverage the celebrity status of Vicky Kaushal to showcase the brand's message of strength and wildness. The ad film portrays Vicky as a powerful body of water that is a force to reckon with, and the fragrance is positioned as a symbol of this strength. The campaign aims to appeal to the masculine sensibilities of the target audience and encourage them to tap into their inner strength and unleash their potential. The launch of Tsunami is expected to attract new customers and strengthen Beardo's position as a market leader.",
    "InfluencersInvolved": "Vicky Kaushal ",
    "IndustryType": "Men's Beauty",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Product Launch",
    "LaunchTimelines": "4 May 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/vickykaushal09",
    "URL": "/images/Influencer-Campaign/BrandLogos/Beardo_swwasn.jpg",
    "PageURL": "embrace-the-tsunami-within",
    "BrandURL": "beardo"
  },
  {
    "id": 31,
    "BrandName": "Amazon Fresh",
    "CampaignTitle": "Amazon Fresh - Nahi Toh Mehenga Padega",
    "CampaignVideo": "https://www.youtube.com/watch?v=bCbiKsEfmk0",
    "Objective": "To promote Amazon Fresh as a superior grocery delivery service compared to its quick-commerce competitors.",
    "Strategy": "Amazon Fresh is emphasizing several key advantages over its competitors. Firstly, the service offers a wider variety of products, eliminating the need for customers to shop from multiple apps. Secondly, there are always discounts available, providing cost savings for customers. Thirdly, Amazon Fresh offers a flexible delivery slot system, which allows customers to select a delivery time that suits their schedule, rather than having to be available immediately after placing an order. This approach differentiates Amazon Fresh from its quick-commerce competitors, who typically emphasize fast delivery times over flexible delivery slots.",
    "InfluencersInvolved": "Manoj Bajpayee",
    "IndustryType": "Online delivery",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "4 May 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/BajpayeeManoj",
    "URL": "/images/Influencer-Campaign/BrandLogos/Amazon_Fresh_zl9uc5.png",
    "PageURL": "amazon-fresh-nahi-toh-mehenga-padega",
    "BrandURL": "amazon-fresh"
  },
  {
    "id": 32,
    "BrandName": "Abu Dhabi",
    "CampaignTitle": "One Summer Isn't Enough",
    "CampaignVideo": "https://youtu.be/ijYaf8FOWu8",
    "Objective": "To promote Abu Dhabi as a diverse and exciting travel destination for Indian travelers.",
    "Strategy": "Abu Dhabi has partnered with Bollywood superstar Ranveer Singh to showcase the destination's unique offerings to Indian travelers. The two-year partnership will see Ranveer share his holiday experiences in Abu Dhabi, highlighting the destination's diverse range of experiences, from cultural and heritage sites to adventure activities and family-friendly attractions. By using a well-known celebrity with a passion for travel, Abu Dhabi is seeking to inspire Indian travelers to add Abu Dhabi to their summer bucket list., The partnership will also leverage Abu Dhabi's action-packed calendar of events, including IIFA, the Abu Dhabi Grand Prix, and the Abu Dhabi NBA Games, to attract visitors looking for exciting and unique experiences. Additionally, Abu Dhabi is offering an exclusive limited-time deal of 'stay more, pay less' to encourage travelers to book longer trips to the destination.",
    "InfluencersInvolved": "Ranveer Singh",
    "IndustryType": "Tourism",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Awareness",
    "LaunchTimelines": "3 May 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/RanveerOfficial",
    "URL": "/images/Influencer-Campaign/BrandLogos/Abu_Dhabi_kpptkp.png",
    "PageURL": "one-summer-isnt-enough",
    "BrandURL": "abu-dhabi"
  },
  {
    "id": 33,
    "BrandName": "Traya HairTreatment & Diagnosis",
    "CampaignTitle": "#HopeForHair",
    "CampaignVideo": "https://www.youtube.com/watch?v=NlqE9I5S-lE",
    "Objective": "The objective of the campaign is to build awareness among people that Traya is committed to solving hair fall internally, and to give hope to those struggling with hair fall issues. The campaign aims to position Traya as a reliable and effective solution to hair fall, thereby boosting the confidence of millions of individuals facing hair fall issues.",
    "Strategy": "The strategy of the campaign is to launch a TVC featuring Raj Kumar Rao, with an emotive playout and a powerful storyline, to highlight the issue of hair fall and its impact on individuals. The TVC is the first part of the campaign that focuses on marriage rejections due to hair fall or receding hairline. The campaign will be supported by a lot of digital initiatives, channel tie-ups, partnerships and collaborations to reach a wider audience. The brand TVC will be released in Hindi across digital platforms like Facebook, Youtube, and Instagram, as well as on OTT platforms and television pan India. The aim is to amplify the campaign across various digital media and the brand’s web page in Hindi & English. Through this campaign, Traya hopes to position itself as a reliable and effective solution to hair fall, giving hope to those struggling with hair fall issues.",
    "InfluencersInvolved": " Raj Kumar Rao",
    "IndustryType": "Health & Wellness",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Awareness",
    "LaunchTimelines": "3 May 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/RajkummarRao",
    "URL": "/images/Influencer-Campaign/BrandLogos/Traya_xwiwnd.png",
    "PageURL": "hopeforhair",
    "BrandURL": "traya-hairtreatment-&-diagnosis"
  },
  {
    "id": 34,
    "BrandName": "Zouk",
    "CampaignTitle": "#modern Indian woman",
    "CampaignVideo": "https://www.youtube.com/watch?v=2uqWrQFK2a0",
    "Objective": "The objective of the partnership between Zouk and Konkona is to establish Zouk as the go-to choice for women on all occasions and to cater to the fashion needs of confident and independent women in India.",
    "Strategy": "The strategy is to leverage Konkona's strong acting prowess, glamor, and unparalleled sense of fashion and style to represent the brand and appeal to young women who look up to trendsetters like top actors or stars. By using the finest materials and unmatched Indian craftsmanship, Zouk aims to provide versatile, thoughtful, and ethical fashion that aligns perfectly with Konkona's values and beliefs. This collaboration celebrates the new India, where fashion and values go hand in hand, and aims to inspire and move consumers with brand experiences that align with their values. By establishing a natural fit between Zouk and Konkona, the partnership seeks to create a positive shift in the way women embrace success and power.",
    "InfluencersInvolved": "Konkona Sen Sharma",
    "IndustryType": "Fashion & lifestyle",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Awareness",
    "LaunchTimelines": "3 May 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/konkonas",
    "URL": "/images/Influencer-Campaign/BrandLogos/Zouk_sbiq3h.png",
    "PageURL": "modern-indian-woman",
    "BrandURL": "zouk"
  },
  {
    "id": 35,
    "BrandName": "Havells",
    "CampaignTitle": " #StopMeriGroomingPeAssuming",
    "CampaignVideo": "https://www.youtube.com/watch?v=cF9uQpCCqoY",
    "Objective": "The objective of Havells' latest digital campaign is to break grooming stereotypes and encourage people to create their own unique style statements without being judged or seeking validation from society. The campaign aims to target the millennial generation and inspire them to change their perspective on personal grooming and appearance.",
    "Strategy": "To achieve the campaign objective, Havells has collaborated with popular actors Vicky Kaushal and Shraddha Kapoor, who share their perspectives on personal grooming, self-worth, and social validation in the campaign. By using popular celebrity figures, the campaign aims to attract the attention of the target audience and create a relatable message. The brand also plans to leverage digital channels to reach a wider audience and encourage engagement. The campaign messaging emphasizes the importance of creating a unique style statement, breaking free from societal judgments, and embracing individuality. By promoting these values, Havells aims to establish itself as a brand that supports and encourages personal expression and individuality.",
    "InfluencersInvolved": "Shraddha Kapoor, Vicky Kaushal",
    "IndustryType": "Men's Grooming",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Awareness",
    "LaunchTimelines": "4 Feb 2022",
    "AgencyName": "82.5 Communications",
    "QoruzProfileLink": "https://app.qoruz.com/profile/ShraddhaKapoor, https://app.qoruz.com/profile/vickykaushal09",
    "URL": "/images/Influencer-Campaign/BrandLogos/Havells_ark4pg.png",
    "PageURL": "stopmerigroomingpeassuming",
    "BrandURL": "havells"
  },
  {
    "id": 36,
    "BrandName": "Charged ( Thums Up )",
    "CampaignTitle": "‘Charger Dena’ ",
    "CampaignVideo": "https://www.youtube.com/watch?v=mKs7EwNHnKY",
    "Objective": "The objective of Thums Up's 'Charger Dena' campaign is to promote its product 'Charged' by Thums Up and encourage the youth to charge themselves up and face challenges with courage and energy.",
    "Strategy": "Thums Up is targeting the ambitious and authentic youth of India with its 'Charger Dena' campaign. The brand has roped in south Indian superstar Vijay Deverakonda to exemplify the same vigor and spirit as the brand. The campaign is being promoted through integrated efforts across TV, social media, digital, and OOH. The messaging of the campaign revolves around charging oneself to fight challenges and adversities head-on and being courageous, energized, and undefeated even in the face of adversity. The campaign aims to inspire the youth to make the most of high-energy moments in their lives by charging themselves up with Charged by Thums Up.",
    "InfluencersInvolved": "Vijay Deverakonda",
    "IndustryType": "FMCG",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Awareness",
    "LaunchTimelines": "3 Mar 2023",
    "AgencyName": "Ogilvy",
    "QoruzProfileLink": "https://app.qoruz.com/profile/TheDeverakonda",
    "URL": "/images/Influencer-Campaign/BrandLogos/Charged_ThumsUp_q9lsfu.png",
    "PageURL": "charger-dena",
    "BrandURL": "charged-thums-up"
  },
  {
    "id": 37,
    "BrandName": "Renault",
    "CampaignTitle": "#LifeOnDemand",
    "CampaignVideo": "https://www.youtube.com/watch?v=0aT4tC2OAQ0",
    "Objective": "To highlight the incredible versatility and adaptability of Renault TRIBER, showcase its modularity and storage options, and create brand awareness.",
    "Strategy": "Renault TRIBER launched a new campaign #LifeOnDemand to showcase the adaptability of the car and its unmatched modularity, with the ability to seat up to 7 people and offer over 100 seat configurations and storage options. The campaign features a TVC with Indian Actor Amit Sadh and is aired across national and regional GEC channels and digital channels, including popular OTT and social media platforms. The strategy is to strike an emotional chord with the consumers, showcase how families and friends can customize the interior of the TRIBER to fit their unique needs and enjoy stress-free adventures while making unforgettable memories with their loved ones. The campaign not only aims to create brand awareness but also highlights Renault's commitment to elevating their brand to a premium level. By highlighting TRIBER's adaptability, the campaign aims to cater to the needs and aspirations of consumers, making it the perfect car for families and adventurers alike.",
    "InfluencersInvolved": "Amit Sadh",
    "IndustryType": "Automobile",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "3 May 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/TheAmitSadh",
    "URL": "/images/Influencer-Campaign/BrandLogos/Renault_aigoi4.jpg",
    "PageURL": "lifeondemand",
    "BrandURL": "renault"
  },
  {
    "id": 38,
    "BrandName": "Sugar Cosmetics",
    "CampaignTitle": "#ShukarHaiSUGARHai",
    "CampaignVideo": "https://www.youtube.com/watch?v=vrhYCqgLnDs",
    "Objective": "The objective of SUGAR Cosmetics' #ShukarHaiSUGARHai campaign is to reinforce the brand's USP of long-lasting makeup and showcase how it can be relied upon to stay flawless, even during special occasions like weddings.",
    "Strategy": "SUGAR Cosmetics has launched the #ShukarHaiSUGARHai campaign on television, OOH, and digital platforms. The latest ad highlights a relatable moment for the brand's core audience - a wedding banquet - where SUGAR plays a key role as a brand that can be depended on to stay flawless, no matter what surprise comes her way. The brand has also created interactive AR gamified filters on Moj to engage with its audience. The campaign has been widely promoted on social media channels, OOH, and TV channels, resulting in over 165 million impressions across all brand-owned social media channels and 2.5+ billion views on Moj. ",
    "InfluencersInvolved": "Ranveer Singh, Tamannah Bhatia",
    "IndustryType": "Beauty",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "4 November 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/RanveerOfficial, https://app.qoruz.com/profile/tamannaahspeaks",
    "URL": "/images/Influencer-Campaign/BrandLogos/Sugar_Cosmetics_mo2og7.png",
    "PageURL": "shukarhaisugarhai",
    "BrandURL": "sugar-cosmetics"
  },
  {
    "id": 39,
    "BrandName": "Yardley London ",
    "CampaignTitle": "Daily Wear Perfumes",
    "CampaignVideo": "https://www.youtube.com/watch?v=sFlF89KQtfg",
    "Objective": "The objective of the campaign is to promote Yardley London's range of perfumes among the new-age young women by highlighting its affordability and exotic natural fragrances. The campaign also aims to empower women to showcase their true potential and step up to the best version of themselves.",
    "Strategy": "The strategy of the campaign is to leverage Yardley's 250 years of legacy in fine fragrances and position the brand as relevant across generations. The campaign aims to communicate that Yardley perfumes are not just about their exotic natural fragrances but also about empowering people to make a lasting impression while stepping up in their professional and daily lives with renewed freshness. The campaign also focuses on democratizing the usage of safe, branded, and international quality perfumes by making it accessible to Indian masses. The campaign is being promoted through a new TV commercial targeting new-age young women, with a message that Yardley perfumes are an affordable entry into the world of fine fragrances.",
    "InfluencersInvolved": "Kriti Sanon",
    "IndustryType": "Beauty",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "2 May 2023",
    "AgencyName": "Wunderman Thompson",
    "QoruzProfileLink": "https://app.qoruz.com/profile/kritisanon.__",
    "URL": "/images/Influencer-Campaign/BrandLogos/Yardley_London_nv5zin.png",
    "PageURL": "daily-wear-perfumes",
    "BrandURL": "yardley-london"
  },
  {
    "id": 40,
    "BrandName": "Saffola Munchiez ( Marico )",
    "CampaignTitle": " Indian Crunch League",
    "CampaignVideo": "https://gumlet.assettype.com/afaqs%2F2023-05%2F5b83d407-f3f4-443d-aebb-ee19302a7402%2FUntitled_design___2023_05_02T171157_250.png?format=webp&w=700&dpr=1.3",
    "CampaignImage": "/images/Influencer-Campaign/CampaignImages/Indian_Crunch_League_gwgsmx.png",
    "Objective": "The objective of Saffola Munchiez's campaign is to engage consumers in an interactive contest during the cricket season, showcase the brand's unique and crunchy Ragi Chips, and promote conscious indulgence among snack lovers. The campaign aims to build brand affinity and increase engagement with the audience.",
    "Strategy": "Saffola Munchiez is leveraging the cricket fever in India to engage with consumers through a unique gamified experience called Indian Crunch League. The campaign aims to promote conscious indulgence among consumers by offering a guilt-free snacking experience with its crunchy and tasty Ragi Chips. The brand has collaborated with celebrities and influencers to amplify the scale of the campaign. The timing of the campaign during the cricket season in the country is strategic, as it is a time when consumers tend to binge on unhealthy snacks. By introducing the concept of conscious indulgence, Saffola Munchiez aims to build a strong brand affinity among its audience and engage with them regularly.",
    "InfluencersInvolved": "Rannvijay Singha",
    "IndustryType": "FMCG",
    "AssetType": "Image",
    "SocialPlatforms": "Instagram",
    "CampaignObjective": "Improve Engagement",
    "LaunchTimelines": "2 May 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/RannvijaySingha",
    "URL": "/images/Influencer-Campaign/BrandLogos/Saffola_Munchiez_igakqz.jpg",
    "PageURL": "indian-crunch-league",
    "BrandURL": "saffola-munchiez-marico"
  },
  {
    "id": 43,
    "BrandName": "Nihar Naturals ( Marico )",
    "CampaignTitle": "Baal Badhenge Bachhe Padhenge",
    "CampaignVideo": "https://www.youtube.com/watch?v=KXaisXBSVVE",
    "CampaignImage": "/images/Influencer-Campaign/CampaignImages/Nihar-Shanti-Amla-onboards-Alia-Bhatt_i5qosa.webp",
    "Objective": "The objective is to build the brand slowly and steadily, without resorting to quick and jumpy tactics, to avoid a negative impact. The use of micro-influencers is expected to drive credibility while maintaining the reach that celebrity influencers provide.",
    "Strategy": "The strategy is to use micro-influencers along with celebrity influencers to balance the mass appeal and credibility of the campaign. The brand plans to run two versions of its ads - a long film and an edit - simultaneously to ensure that the entire thematic story lands with the long version while the short edit builds frequency.",
    "InfluencersInvolved": "Alia Bhatt",
    "IndustryType": "Beauty",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Building",
    "LaunchTimelines": "15 May 2023",
    "AgencyName": "Ogilvy",
    "QoruzProfileLink": "https://app.qoruz.com/profile/aliaa08",
    "URL": "/images/Influencer-Campaign/BrandLogos/Nihar_Naturals_ssv59y.jpg",
    "PageURL": "baal-badhenge-bachhe-padhenge",
    "BrandURL": "nihar-naturals-marico"
  },
  {
    "id": 44,
    "BrandName": "makeO toothsi",
    "CampaignTitle": "#EasyPeasytoothsi",
    "CampaignVideo": "https://www.youtube.com/watch?v=NHSqgeVWmXA",
    "Objective": "The objective of the marketing strategy for makeO toothsi is to educate and raise awareness among people about the hassle-free at-home teeth alignment service provided by the brand. The goal is to position makeO toothsi as a quick and convenient alternative to traditional metal braces and reach out to a wide range of potential customers, including those who may not be reached through traditional digital channels.",
    "Strategy": "The strategy involves leveraging the ongoing TATA IPL 2023 and advertising featuring celebrity couple Virat Kohli and Anushka Sharma to increase brand visibility and capture the attention of the target audience. By cleverly comparing the at-home service to an online food delivery app, the brand aims to highlight the convenience and ease of using makeO toothsi aligners. The IPL platform provides an opportunity to reach out to a large audience and attract new users into the sales funnel. Additionally, the brand aims to educate people about the availability of corrective teeth alignment solutions at any age and emphasize that teeth straightening is not limited to kids. The target audience includes individuals between the ages of 25 and 40, with popularity among both males and females. While the brand has primarily focused on the top eight metros of India, there is also significant demand from Tier-II cities, indicating the potential for expansion and growth in these areas.",
    "InfluencersInvolved": " Virat Kohli, Anushka Sharma",
    "IndustryType": "Beauty",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "17 Apr 2023",
    "AgencyName": "Creativeland Asia",
    "QoruzProfileLink": "https://app.qoruz.com/profile/imVkohli, https://app.qoruz.com/profile/AnushkaSharma",
    "URL": "/images/Influencer-Campaign/BrandLogos/MakeO_toothsi_d7t0rj.jpg",
    "PageURL": "easypeasytoothsi",
    "BrandURL": "makeo-toothsi"
  },
  {
    "id": 45,
    "BrandName": "VLCC",
    "CampaignTitle": "#AbDhoopKyaRokegi",
    "CampaignVideo": "https://www.youtube.com/watch?v=9l7duJzvZn8",
    "Objective": "The objective of the VLCC #AbDhoopKyaRokegi campaign is to instill confidence in individuals to face the sun by promoting the brand's highly effective SPF 60 PA+++ sweat and water-resistant sunscreen gel crème. The campaign aims to change the narrative around sunscreen and emphasize its core benefit of protection and efficacy. It also intends to challenge societal norms that hold women back from achieving their desires due to the fear of getting tanned.",
    "Strategy": "The strategy of the campaign involves showcasing the rigorous testing of the VLCC SPF60 sunscreen to establish its maximum protection against harmful UVA and UVB rays, even in extreme heat and sun. The campaign features Sakshi Chavan, an International Gold Medalist in 100m running, to reinforce the message of staying protected from the sun and inspire young Indian women to be unstoppable in pursuing their goals. The use of real-life women who inspire their generation brings authenticity to the campaign and changes the narrative around sunscreen. The campaign will have a strong presence on TV, digital platforms, activation, and retail, ensuring that all relevant touchpoints are activated to influence both consumers and trade. By challenging the sun itself and societal norms, the campaign aims to empower women to step out confidently and achieve their desires.",
    "InfluencersInvolved": "Sakshi Chavan",
    "IndustryType": "Beauty",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Product Promotion",
    "LaunchTimelines": "15 May 2023",
    "AgencyName": "DENTSU CREATIVE",
    "QoruzProfileLink": "",
    "URL": "/images/Influencer-Campaign/BrandLogos/VLCC_ofx3va.png",
    "PageURL": "abdhoopkyarokegi",
    "BrandURL": "vlcc"
  },
  {
    "id": 46,
    "BrandName": "LANEIGE",
    "CampaignTitle": "Laneige x Athiya Shetty",
    "CampaignVideo": "https://gumlet.assettype.com/afaqs%2F2023-05%2Fa366c62f-d1d2-4da6-8ab0-a1e0f634a440%2FKorean_Beauty_Brand__Laneige_Announces_Athiya_Shetty_as_the_first_ever_face_in_India__1___1_.jpg?rect=0%2C1029%2C2500%2C1406&format=webp&w=700&dpr=1.3",
    "CampaignImage": "/images/Influencer-Campaign/CampaignImages/Laneige_x_Athiya_Shetty_vu2p1i.png",
    "Objective": "The objective of the collaboration between Laneige and Athiya Shetty is to increase the brand's presence and influence in the Indian beauty industry. The aim is to engage a wider audience and empower individuals to embrace their natural beauty. The partnership with Athiya Shetty is expected to create a lasting impact, enhance brand awareness, and contribute to the brand's commitment to innovation and water science.",
    "Strategy": "The strategy involves leveraging Athiya Shetty's popularity, influence, and genuine connection with her fans and followers to represent Laneige's line of skincare products in India. By associating with Athiya, Laneige aims to engage with a wider audience and promote the values of natural and sustainable beauty. The partnership is expected to create a lasting impact, increase brand presence, and make beauty more inclusive, inspiring, and empowering. The objective is to achieve excellent results through this collaboration, and Laneige is determined to put in the best effort to achieve their goals together.",
    "InfluencersInvolved": "Athiya Shetty",
    "IndustryType": "Beauty",
    "AssetType": "Image",
    "SocialPlatforms": "",
    "CampaignObjective": "Brand Presence",
    "LaunchTimelines": "2 May 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/athiyashetty",
    "URL": "/images/Influencer-Campaign/BrandLogos/Laneige_t6zn6t.png",
    "PageURL": "laneige-x-athiya-shetty",
    "BrandURL": "laneige"
  },
  {
    "id": 48,
    "BrandName": "7UP",
    "CampaignTitle": "Super Duper Refresher",
    "CampaignVideo": "https://www.youtube.com/watch?v=z0a15-oU8X4",
    "Objective": "To promote 7Up as a refreshing drink for the summer and highlight its ability to help beat the heat in difficult situations.",
    "Strategy": "The brand has created a 360-degree campaign with a focus on TV, digital, outdoor, and social media, featuring a new TV commercial with musician Anirudh Ravichander and the brand's new face, actress Rashmika Mandanna. The campaign aims to appeal to the youth by promoting 7Up as the ultimate upliftment anthem for the summer. By using popular faces and a catchy tune, the brand intends to position itself as the go-to drink for refreshing experiences in difficult situations like traffic jams during hot summer days.",
    "InfluencersInvolved": "Anirudh Ravichander",
    "IndustryType": "FMCG",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "18 Apr 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/anirudhofficial",
    "URL": "/images/Influencer-Campaign/BrandLogos/7_Up_pp4fmn.png",
    "PageURL": "super-duper-refresher",
    "BrandURL": "7up"
  },
  {
    "id": 49,
    "BrandName": "IRUS Eyewear",
    "CampaignTitle": " ‘All Eyes On Me’",
    "CampaignVideo": "https://www.youtube.com/watch?v=_dmSBx3WVCM",
    "Objective": "To launch IRUS’ campaign, ‘All Eyes on Me’, featuring Bollywood actor Kartik Aaryan as the face of the brand, and showcase the brand’s commitment to empowering individuals to express their unique personalities through fashion. The campaign aims to highlight IRUS’ cutting-edge designs and diverse range of eyewear options, appealing to fashion enthusiasts and trendsetters alike.",
    "Strategy": "IRUS has collaborated with Bollywood youth icon Kartik Aaryan to launch its second campaign, ‘All Eyes on Me’. The campaign will be showcased through a series of captivating visuals, highlighting IRUS’ latest collection, from trendy casual wear to glamorous red carpet ensembles. The campaign will be amplified across various channels, including TV, digital, outdoor, and social media, targeting the brand’s young audience. By featuring Kartik Aaryan, known for his versatility and charm, the campaign aims to ignite a fresh wave of excitement and style among fashion-forward individuals. The brand’s commitment to empowering individuals to express their unique personalities through fashion will be showcased through the ‘All Eyes on Me’ campaign, positioning IRUS as a revolutionary eyewear brand that truly understands the desires of its young audience. The campaign also aims to embrace the generation that is always the main character in their life, showcasing IRUS as a brand that resonates with the youth.",
    "InfluencersInvolved": " Kartik Aaryan",
    "IndustryType": "Fashion & lifestyle",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "15 May 2023",
    "AgencyName": "Makani Creatives",
    "QoruzProfileLink": "https://app.qoruz.com/profile/theaaryankartik",
    "URL": "/images/Influencer-Campaign/BrandLogos/IRUS_eyewear_n2dz5q.png",
    "PageURL": "all-eyes-on-me",
    "BrandURL": "irus-eyewear"
  },
  {
    "id": 50,
    "BrandName": "Freecharge",
    "CampaignTitle": "‘Pay Kar. Befikar’ ",
    "CampaignVideo": "https://www.youtube.com/watch?v=mdrTgehJd-o",
    "Objective": "The objective of Freecharge's IPL campaign is to increase brand awareness, expand their customer base, and position themselves as a one-stop solution for all payment and credit needs. The success parameters of the campaign will be measured by an increase in traffic on the Freecharge app and mobile site. Freecharge aims to leverage the IPL's reach to enhance brand recall and awareness, expand their footprint, and acquire new customers. The company also wants to target small merchants and business owners and plans to focus on local media to reach out to local markets.",
    "Strategy": "Freecharge's strategy for the IPL campaign is to differentiate itself from the clutter by leveraging the value that the IPL brings to an ad. The brand is promoting the ad on other digital platforms and partnering with JioCinema instead of Star Sports. This decision was made because Freecharge is a mobile-first digital financial services platform, and the digital strategy is more in tune with the overall brand strategy. Partnering with an OTT platform is more relevant and cost-effective for the brand. Freecharge plans to focus on local media for its overall marketing strategy and will look to do a lot of stuff on local media in the states and cities that are its focus areas. The brand will not focus on ATL and national media again and again. In addition, Freecharge aims to position itself as the leading fintech in the country, offering both payment and lending solutions to small and mid-size merchants. The company plans to transform itself to become a meaningful lending fintech in the country and not just a payments platform.",
    "InfluencersInvolved": "Jaideep Ahlawat",
    "IndustryType": "Fintech",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "18 Apr 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/jaideepahlawat",
    "URL": "/images/Influencer-Campaign/BrandLogos/Freecharge_caocoi.png",
    "PageURL": "pay-kar-befikar",
    "BrandURL": "freecharge"
  },
  {
    "id": 52,
    "BrandName": "John Player",
    "CampaignTitle": "Play it Real",
    "CampaignVideo": "https://www.youtube.com/watch?v=5zOqyslCTqU",
    "Objective": "The objective of John Players' brand relaunch campaign is to establish itself as a fashion brand for young men who value individuality and self-expression. The campaign aims to resonate with the target audience by emphasizing the brand's expression, 'Play it Real,' which aligns with the aspirations of young men looking to make their mark in the world. The objective is to position John Players as a brand that encourages individuals to embrace their unique identity and wear it proudly, both in the virtual and real world.",
    "Strategy": "John Players' strategy for the brand relaunch campaign involves partnering with actor Sidharth Malhotra as the brand spokesperson and ambassador. Sidharth Malhotra's status as a style icon and his recent success in the film industry make him an ideal fit to represent the brand. The campaign showcases Sidharth Malhotra in the new John Players film, staying true to his own personality and style. The emphasis is on his easy flair, positive impact on others, and the playful charm that resonates with the brand's values. The campaign aims to highlight the synergy between John Players and Sidharth Malhotra, both sharing a love for playful charm and meaningful values in a fast-paced world. By associating with Sidharth Malhotra, the brand taps into his popularity and relatability among the target audience. The messaging of the campaign revolves around the idea that style goes beyond mere appearance and represents standing for something meaningful. John Players aims to be the brand that young men can relate to and find value in, not just in terms of fashion but also in terms of character and values.",
    "InfluencersInvolved": " Sidharth Malhotra",
    "IndustryType": "Fashion & lifestyle",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Relaunch",
    "LaunchTimelines": "6 Apr 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/S1dharthM",
    "URL": "/images/Influencer-Campaign/BrandLogos/John_Player_epc81i.png",
    "PageURL": "pla-it-real",
    "BrandURL": "john-player"
  },
  {
    "id": 53,
    "BrandName": "Euro Fashion Inners",
    "CampaignTitle": " “Chumbak hai bhai”",
    "CampaignVideo": "https://www.youtube.com/watch?v=UTH4V81wQfQ",
    "Objective": "The objective of Euro Fashion Inners' new campaign for 2023-2024 is to target and engage with the Gen Z audience, offering them fashion products that align with their preferences. The campaign aims to create brand awareness, increase brand association with youth culture, and ultimately drive sales among young consumers. Euro Fashion Inners seeks to position itself as a trendy and relatable brand for the youth.",
    "Strategy": "Euro Fashion Inners' strategy for the new campaign involves appointing Bollywood actor Kartik Aaryan as the brand ambassador. Kartik Aaryan's popularity among the target audience, especially the youth, makes him a suitable choice to represent the brand. The campaign focuses on showcasing Euro's products designed with prints, patterns, and colors that are in demand among the Gen Z consumers.The campaign, titled 'Chumbak Hai Bhai,' aims to be witty, tongue-in-cheek, and good-humored, resonating with the young audience. The messaging and tone of the campaign are designed to connect with the youth on a relatable and humorous level. To reach the target audience effectively, Euro Fashion Inners has planned a high decibel campaign across various channels. This includes print media, out-of-home advertising, and digital platforms. The multi-channel approach ensures maximum reach and engagement among young consumers across different touchpoints. By leveraging Kartik Aaryan's popularity, incorporating relatable messaging, and utilizing a mix of traditional and digital advertising channels, Euro Fashion Inners aims to establish a strong brand presence among the youth. The strategy is to position Euro as a fashionable and trendy innerwear brand that resonates with the preferences and style of the Gen Z audience.",
    "InfluencersInvolved": "Kartik Aaryan",
    "IndustryType": "Fashion & lifestyle",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "15 May 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/theaaryankartik",
    "URL": "/images/Influencer-Campaign/BrandLogos/Euro_Fashion_Inners_vdx7ol.png",
    "PageURL": "chumba-hai-bhai",
    "BrandURL": "euro-fashion-inners"
  },
  {
    "id": 54,
    "BrandName": "Navratna Oil ",
    "CampaignTitle": "Jaadu ki Champi",
    "CampaignVideo": "https://www.youtube.com/watch?v=IT20b5ej8v4",
    "Objective": "The objective of Navratna Oil's new campaign is to promote the brand's champi (head massage) ritual and create a strong brand presence in the minds of consumers. The campaign aims to position Navratna Oil as a refreshing and rejuvenating product that provides a quick and effective solution for relaxation in today's hectic world. The campaign also aims to leverage the star power of Salman Khan, the brand ambassador, to increase brand recall and engagement among the target audience.",
    "Strategy": "Navratna Oil's strategy for the campaign revolves around showcasing Salman Khan in a magician's avatar, adding an element of fun and entertainment to the concept of champi. By presenting Salman Khan in a different and unique role, the campaign seeks to captivate the audience's attention and create curiosity. The film highlights the champi ritual as a traditional Indian practice of self-care and self-love, emphasizing its importance in today's fast-paced lifestyle.The campaign aims to tap into the trend of self-care and promote the champi ritual as a simple and effective way to take time out for oneself. By using the campaign line 'Jaadu ki Champi' (Magical Head Massage), Navratna Oil aims to create an association between the brand and the rejuvenating benefits of the product. The inclusion of a catchy song and Salman Khan's dance moves adds entertainment value and engages the audience on a more emotional level.",
    "InfluencersInvolved": "Salman Khan",
    "IndustryType": "Men's Grooming",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "5 Apr 2023",
    "AgencyName": "WYP Brand Solution Private Limited",
    "QoruzProfileLink": "https://app.qoruz.com/profile/BeingSalmanKhan",
    "URL": "/images/Influencer-Campaign/BrandLogos/Navratna_Oil_vfq3ty.png",
    "PageURL": "jaadu-ki-champi",
    "BrandURL": "navratna-oil"
  },
  {
    "id": 55,
    "BrandName": "Noise",
    "CampaignTitle": "#SunoDilKaShor",
    "CampaignVideo": "https://www.youtube.com/watch?v=C_PJjvRNz60",
    "Objective": "The objective of Noise's new digital ad campaign, #SunoDilKaShor, is to establish Noise smartwatches as lifestyle companions that empower and elevate the lives of consumers. The campaign aims to showcase the brand's commitment to consumer-centric innovation and position their smartwatches as reliable and stylish devices that cater to consumers' lifestyle goals. It also seeks to resonate with a larger audience base and create a relatable connection with consumers.",
    "Strategy": "Noise's strategy for the #SunoDilKaShor campaign revolves around the concept of listening to one's inner voice or 'noise within.'The campaign emphasizes the brand's understanding of consumers' needs and desires, positioning Noise smartwatches as tools that enable users to pursue their lifestyle goals while staying connected to their own inner voice. By featuring Virat Kohli, a popular and influential figure in Indian cricket, as the brand ambassador, Noise aims to leverage his star power and connect with a broader audience. The campaign emphasizes the reliability and trustworthiness of Noise smartwatches, showcasing them as companions that stand tall with users in their journey of life, supporting them in achieving their goals.",
    "InfluencersInvolved": "Virat Kohli",
    "IndustryType": "Electronics",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "4 Apr 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/imVkohli?search_id=1684917754",
    "URL": "/images/Influencer-Campaign/BrandLogos/Noise_aqxvl1.png",
    "PageURL": "sunodilkashor",
    "BrandURL": "noise"
  },
  {
    "id": 56,
    "BrandName": "The House of Haique",
    "CampaignTitle": "A New Age of Iconic Luxury",
    "CampaignVideo": "https://www.youtube.com/watch?v=lGl5mw7xMFk",
    "Objective": "The objective of The House of Haique's latest campaign is to connect the brand with interior lovers who have a unique sense for luxury surfaces. By featuring Vaani Kapoor as the brand ambassador, the campaign aims to enhance brand visibility and create a strong association between The House of Haique and luxury surfaces in the minds of the Indian audience. The campaign also seeks to highlight the launch of Neo Marble and Terrazzo, showcasing the brand's expansion beyond the Quartz segment and positioning it as a game changer in the industry.",
    "Strategy": "The House of Haique has strategically collaborated with Vaani Kapoor, a popular Bollywood actress and youth icon, to leverage her popularity and connect with a wider audience. The brand aims to align itself with Vaani's values and beliefs, establishing a strong connection between her persona and the luxury surfaces offered by The House of Haique. The campaign focuses on the launch of Neo Marble and Terrazzo, emphasizing the unique features and advantages of these products. The brand highlights that Neo Marble is India's biggest slab, 43% larger in size, which brings cost savings in terms of unloading, storing, and installation. By showcasing the practical benefits and advantages of their surfaces, The House of Haique aims to appeal to architects, interior designers, and construction professionals working on villas and high-rise projects.",
    "InfluencersInvolved": "Vaani Kapoor",
    "IndustryType": "Home & Decor",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "4 Apr 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/Vaaniofficial",
    "URL": "/images/Influencer-Campaign/BrandLogos/The_House_of_Haique_dkocxj.png",
    "PageURL": "a-new-age-of-iconic-luxury",
    "BrandURL": "the-house-of-haique"
  },
  {
    "id": 57,
    "BrandName": "The Label Life ",
    "CampaignTitle": "#EscapeReality: We’ve found the key.",
    "CampaignVideo": "https://youtu.be/YKzPAAHKJ6I",
    "Objective": "The objective of The Label Life's campaign is to position their brand as a means of breaking free from the mundane and escaping reality through fashion. They aim to convey the transformative and transporting nature of fashion and highlight how their designs can bring a fresh perspective to everyday dressing.",
    "Strategy": "The campaign employs various elements to achieve its objective. The approach, setting, clothes, and concept are carefully designed to create a narrative that portrays fashion as a game-changer and a key to escaping the ordinary. By emphasizing the ability of their clothing to elevate style and offer a new perspective, The Label Life seeks to attract customers who desire a fashion-forward approach to their everyday lives. Through compelling visuals, storytelling, and a focus on the transformative power of fashion, the campaign aims to resonate with the target audience and establish The Label Life as a brand that offers an escape from the mundane and a gateway to a more stylish and elevated reality.",
    "InfluencersInvolved": "Malaika Arora",
    "IndustryType": "Fashion & lifestyle",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "4 Apr 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/malaikaaroraofficial_1",
    "URL": "/images/Influencer-Campaign/BrandLogos/The_Label_Life_tztop5.png",
    "PageURL": "escapereality-Weve-found-the-key",
    "BrandURL": "the-house-of-haique"
  },
  {
    "id": 58,
    "BrandName": "Visa",
    "CampaignTitle": "‘Pay Safe with Visa’",
    "CampaignVideo": "https://www.youtube.com/watch?v=SLKpzX9fxbI",
    "Objective": "The objective of Visa's 'Pay Safe with Visa' campaign in India is to promote the safety and convenience of card payments in everyday usage. The campaign aims to highlight Visa's position as a trusted brand in digital payments and emphasize the peace of mind that consumers can experience when using their Visa cards for transactions.",
    "Strategy": "The campaign utilizes the popular Bollywood star and actor Vicky Kaushal as the face of the campaign to enhance its appeal and reach among the target audience. By featuring three films of 30 seconds each, the campaign effectively communicates the key message of safety and convenience in card payments. The first film was released on 1st April 2023, signaling the start of the campaign. Through the campaign, Visa aims to showcase the enduring reliability and security of card payments, leveraging its long-standing reputation as a global leader in digital payments. By associating the brand with Vicky Kaushal, a well-known celebrity, Visa seeks to establish trust and credibility among consumers, highlighting the benefits of paying safely with Visa cards.",
    "InfluencersInvolved": "Vicky Kaushal",
    "IndustryType": "Fintech",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "3 Apr 2023",
    "AgencyName": "Leo Burnett India",
    "QoruzProfileLink": "https://app.qoruz.com/profile/vickykaushal09",
    "URL": "/images/Influencer-Campaign/BrandLogos/Visa_ffklxy.png",
    "PageURL": "pay-safe-with-visa",
    "BrandURL": "visa"
  },
  {
    "id": 59,
    "BrandName": "Taco Bell and Microsoft Xbox",
    "CampaignTitle": "#PlayTheTaco",
    "CampaignVideo": "https://www.youtube.com/watch?v=a3A2PZs2foU",
    "Objective": "The objective of Taco Bell's campaign with Hardik Pandya as its brand ambassador is to promote its partnership with Microsoft Xbox and drive consumer engagement. The campaign aims to encourage participation in a month-long giveaway where customers have a chance to win Xbox Series S gaming consoles and 12-month game passes.",
    "Strategy": "The campaign strategy involves leveraging the popularity and influence of Hardik Pandya, a well-known cricket all-rounder and youth icon, to create excitement and attract the target audience. Taco Bell will go-live with multiple digital activations throughout the month, featuring Hardik Pandya, to boost participation and keep consumers engaged. The film aims to generate interest and showcase the partnership to the brand's audiences.The campaign encourages consumers to place orders through various channels, including the Taco Bell app, delivery apps, dine-in, or takeaway, and provides explicit terms and conditions for eligibility. Taco Bell will give away 28 Xbox Series S gaming consoles and 12-month game passes to lucky winners.",
    "InfluencersInvolved": "Hardik Pandya",
    "IndustryType": "Food",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Partnership Promotion",
    "LaunchTimelines": "3 Apr 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/hardikpandya93",
    "URL": "/images/Influencer-Campaign/BrandLogos/Taco_Bell_dpvpfs.png",
    "PageURL": "playthetaco",
    "BrandURL": "taco-bell-and-microsoft-xbox"
  },
  {
    "id": 60,
    "BrandName": "Kotak Mahindra Bank",
    "CampaignTitle": "#AlertRaheinSafeRahein",
    "CampaignVideo": "https://www.youtube.com/watch?v=sWGgQOrJIWk",
    "Objective": "The objective of Kotak Mahindra Bank's campaign featuring Gulshan Grover is to create awareness about safe banking practices and raise customer vigilance against fraudsters. The campaign aims to emphasize that fraudsters are always active and individuals need to stay cautious and proactive in protecting their personal information and financial security.",
    "Strategy": "The campaign strategy revolves around leveraging the credibility and impact of Gulshan Grover, a veteran actor known for his powerful character portrayals in Indian Cinema. By choosing April Fools' Day as the launch date, Kotak Mahindra Bank aims to highlight that fraudsters don't wait for a specific day to strike and that individuals need to be vigilant at all times.The campaign's film delivers a simple yet important message to customers: always stay alert and adopt safe banking practices.The campaign aims to create awareness among Kotak Mahindra Bank's customers and the general public about the importance of safe banking practices in the digital age. By leveraging the influence of Gulshan Grover and delivering a clear message, the campaign intends to educate customers and empower them to protect themselves from fraud.",
    "InfluencersInvolved": "Gulshan Grover",
    "IndustryType": "Banking",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Awareness",
    "LaunchTimelines": "3 Apr 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/GulshanGroverGG",
    "URL": "/images/Influencer-Campaign/BrandLogos/Kotak_Mahindra_Bank_hwf0yu.png",
    "PageURL": "alertraheinsaferahein",
    "BrandURL": "kotak-mahindra-bank"
  },
  {
    "id": 61,
    "BrandName": "Spinny",
    "CampaignTitle": "‘Go Far For Your Squad’",
    "CampaignVideo": "https://www.youtube.com/watch?v=p_1qbhEZDyM",
    "Objective": "The objective of the campaign titled 'Go Far For Your Squad' is to promote Spinny, a platform for buying and selling used cars, by leveraging the popularity of the Indian Premier League (IPL) and featuring cricketing legends in an entertaining road trip concept. The campaign aims to target Tier-I audiences, specifically up to 32 years of age, and create visibility for Spinny as a trustworthy and comprehensive platform for used car purchases.",
    "Strategy": "The campaign strategy revolves around creating an entertaining and delightful experience for the audience by showcasing the lighter and more relatable side of IPL legends. The road trip concept featuring the three cricketing legends aims to capture the attention and engagement of the target audience during IPL ad breaks. The campaign aims to highlight Spinny's unique value proposition as a platform that offers a full-stack model with all processes owned by Spinny, differentiating it from other platforms that typically rely on franchise dealerships. The campaign's target audience includes both men and women, with Spinny's platform already having a significant female buyer base. By focusing on both genders, the campaign aims to expand its reach and appeal to a diverse audience.",
    "InfluencersInvolved": "Sachin Tendulkar, Anil Kumble, Yuvraj Singh. ",
    "IndustryType": "Automobile",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Awareness",
    "LaunchTimelines": "3 Apr 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/sachin_rt, https://app.qoruz.com/profile/anilkumble1074, https://app.qoruz.com/profile/YUVSTRONG12",
    "URL": "/images/Influencer-Campaign/BrandLogos/Spinny_w83xaz.png",
    "PageURL": "go-far-for-your-squad",
    "BrandURL": "spinny"
  },
  {
    "id": 62,
    "BrandName": "Skipper Pipes",
    "CampaignTitle": "Skipper for life",
    "CampaignVideo": "https://www.youtube.com/watch?v=Mv72z6PRQxg",
    "Objective": "The objective of Skipper Limited's campaign is to raise awareness about the importance of using 100% lead-free pipes and fittings for safe water supply systems. By collaborating with brand ambassadors Mahendra Singh Dhoni and Chris Gayle, Skipper aims to position itself as a leading player in the industry and emphasize its commitment to providing safe and reliable piping solutions.",
    "Strategy": "The campaign strategy focuses on leveraging the popularity and credibility of Mahendra Singh Dhoni and Chris Gayle as renowned cricketers to spread awareness about safe water supply. By associating with Dhoni, who is considered the skipper or captain of the Indian cricket team, Skipper aims to enhance its brand image and establish itself as a trusted and authoritative player in the industry.This strategy aims to capture the attention and engagement of the target audience, ensuring that the message about using lead-free pipes resonates with them.",
    "InfluencersInvolved": "M.S. Dhoni, Chris Gayle",
    "IndustryType": "Commercial Company",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Awareness",
    "LaunchTimelines": "31 Mar 2023",
    "AgencyName": "Lowe Lintas",
    "QoruzProfileLink": "https://app.qoruz.com/profile/msdhoni, https://app.qoruz.com/profile/chrisgayle333",
    "URL": "/images/Influencer-Campaign/BrandLogos/Skipper_Pipes_yt82yr.jpg",
    "PageURL": "skipper-for-life",
    "BrandURL": "skipper-pipes"
  },
  {
    "id": 63,
    "BrandName": "Siyaram",
    "CampaignTitle": "The best among the west",
    "CampaignVideo": "https://www.youtube.com/watch?v=i_ybJ38HYkU",
    "Objective": "The objective of Siyaram's influencer-led campaign is to promote the brand's classy and in-style range among young adults, specifically targeting those who prefer to look their best during special occasions. The campaign aims to capture the attention of the youth segment and generate curiosity, ultimately driving them to explore Siyaram's range of offerings.",
    "Strategy": "Siyaram's adopted an interesting marketing route by launching a teaser on their social media platform featuring Aparshakti Khurana in a dilemma. This approach utilizes curiosity marketing to create intrigue and engage untapped audience segments. The brand recognized the potential of curiosity-driven marketing to attract the younger demographic and generate interest in their range of products. By collaborating with youth icon Aparshakti Khurana, Siyaram's aims to establish a strong connection with the target audience. Aparshakti Khurana's synergy with the brand helps to create a relatable and authentic appeal to the youth. The influencer-led campaign leverages Aparshakti's popularity and his ability to resonate with the target demographic, making him an ideal choice for promoting Siyaram's classy and in-style range.",
    "InfluencersInvolved": "Aparshakti Khurana",
    "IndustryType": "Fashion & lifestyle",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Awareness",
    "LaunchTimelines": "30 Mar 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/aparshakti_khurana",
    "URL": "/images/Influencer-Campaign/BrandLogos/Siyaram_dxqozo.png",
    "PageURL": "the-best-among-the-west",
    "BrandURL": "siyaram"
  },
  {
    "id": 64,
    "BrandName": "Star Sports ",
    "CampaignTitle": "#IPLSutradhaar",
    "CampaignVideo": "https://www.youtube.com/watch?v=_SHKszGz7cw",
    "Objective": "The objective of Star Sports' collaboration with brand ambassador Ranveer Singh is to leverage his massive popularity and deep love for sports to connect with diverse audience cohorts and fuel fandom and passion for sports in India. The association aims to make India a sporting nation by engaging new audiences who have not yet developed a deep relationship with sports.",
    "Strategy": "By appointing Bollywood superstar Ranveer Singh as the brand ambassador, Star Sports aims to tap into his vast fan base and influence to promote sports and engage a wider audience. Ranveer Singh's role as the 'sutradhaar' for the upcoming season of the 'Incredible League' involves creating immersive and entertaining content that brings alive compelling narratives from the past, present, and future of the league. Star Sports aims to utilize Ranveer Singh's popularity and storytelling skills to create engaging content that resonates with a diverse range of audiences. By doing so, they seek to attract new fans and build a strong sports culture in India. By leveraging Ranveer Singh's influence, the brand aims to ignite interest, increase viewership, and create a deeper connection between fans and sports.",
    "InfluencersInvolved": "Ranveer Singh",
    "IndustryType": "Entertainment",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "29 Mar 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/RanveerOfficial",
    "URL": "/images/Influencer-Campaign/BrandLogos/Star_Sports_otz7ke.jpg",
    "PageURL": "iplsutradhaar",
    "BrandURL": "star-sports"
  },
  {
    "id": 65,
    "BrandName": "Celio",
    "CampaignTitle": "#CelioDoItYourWay",
    "CampaignVideo": "https://www.youtube.com/watch?v=GxbzpNIxT7o",
    "Objective": "The objective of Celio India's campaign #CelioDoItYourWay is to celebrate individuality and inspire people to embrace their uniqueness. The campaign aims to encourage individuals to break away from conventional norms, take risks, and pursue their passions. It also highlights Celio's commitment to bringing together the best of Indian and French artists, showcasing their French heritage and differentiation in the Indian menswear fashion scene.",
    "Strategy": "The campaign, conceptualized by Havas Worldwide India, revolves around the theme of 'Do It Your Way.' It celebrates men who defy societal norms and carve their own paths in life. The campaign features a music video starring popular icons Emiway Bantai, Ranveer Allahbadia, Umran Malik, and Naâman, with a catchy soundtrack that aims to inspire and motivate the audience. The campaign's strategy is to position Celio as a brand that understands and celebrates the spirit of the young millennial and Gen Z generation. By emphasizing the brand's French heritage and unique fashion collection, Celio aims to provide a platform for self-expression and individual style. It encourages individuals to forge their own path, define success on their terms, and break away from herd mentality. The campaign's message is about listening to one's heart and pursuing one's passions.",
    "InfluencersInvolved": " Emiway Bantai, Naaman, Ranveer Allahbadia, Umran Malik",
    "IndustryType": "Fashion & lifestyle",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "29 Mar 2023",
    "AgencyName": "Havas Worldwide India",
    "QoruzProfileLink": "https://app.qoruz.com/profile/sharukhshaikh3, , https://app.qoruz.com/profile/beerbiceps, ",
    "URL": "/images/Influencer-Campaign/BrandLogos/Celio_fsuigz.png",
    "PageURL": "celiodoityourway",
    "BrandURL": "celio"
  },
  {
    "id": 66,
    "BrandName": "Vivo",
    "CampaignTitle": "India's 1st Wedding style portrait",
    "CampaignVideo": "https://www.youtube.com/watch?v=eB4yFm2PWZw",
    "Objective": "The objective of vivo's campaign for the V27 Series is to connect with consumers by tapping into the cultural significance of the big fat Indian wedding. The campaign aims to highlight the role of loved ones, particularly close siblings, in making wedding moments special. It also aims to position the vivo V27 Series as a must-have smartphone for the wedding season.",
    "Strategy": "vivo's strategy revolves around consumer orientation and offering products that add value to consumers' lives. The company proactively studies consumers' needs, lifestyles, and cultural preferences to create campaigns that resonate with them. The campaign aims to connect with the audience on an emotional level by capturing the essence of Indian weddings and the role of close relationships in creating memorable moments. By doing so, vivo seeks to establish a strong connection between the brand and consumers, positioning the vivo V27 Series as a smartphone that complements and enhances the wedding experience. By tapping into the cultural significance of Indian weddings, vivo aims to capture the attention and interest of its target audience during the wedding season.",
    "InfluencersInvolved": "Karan Wahi, Anya Singh",
    "IndustryType": "Electronics",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "29 Mar 2023",
    "AgencyName": "Havas Worldwide India",
    "QoruzProfileLink": "https://app.qoruz.com/profile/karan009wahi, https://app.qoruz.com/profile/anyasinghofficial",    
    "URL": "/images/Influencer-Campaign/BrandLogos/VIVO_i3zukh.png",
    "PageURL": "indias-1st-wedding-style-portrait",
    "BrandURL": "vivo"
  },
  {
    "id": 67,
    "BrandName": "KBM Spices ",
    "CampaignTitle": "Khana Banaye Mazedaar",
    "CampaignVideo": "https://www.youtube.com/watch?v=dHwzLuNwE0k",
    "Objective": "The objective of KBM Spices' collaboration with Parineeti Chopra as its brand ambassador is to support the company's expansion plans and increase its market share in the Indian spices industry. By associating with a popular Bollywood star like Parineeti Chopra, the brand aims to enhance its brand image, connect with a larger audience, and introduce a fresh look to its products.",
    "Strategy": "KBM Spices has identified the need to expand its presence beyond the Delhi-NCR markets and tap into the entire North Indian region and other parts of the country. To achieve this, the company plans to leverage its extensive product range and strong marketing networks, supported by an omnichannel marketing and sales approach. By appointing Parineeti Chopra as its brand ambassador, KBM Spices aims to capitalize on her popularity and appeal among millions of people across the country. Parineeti Chopra's bold and vibrant personality aligns with the brand's values and provides a fresh perspective, helping KBM Spices connect with a wider audience and prepares to expand its product line and target a broader customer base.",
    "InfluencersInvolved": "Parineeti Chopra",
    "IndustryType": "Food",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "28 Mar 2023",
    "AgencyName": "",
    "QoruzProfileLink": "ttps://app.qoruz.com/profile/ParineetiChopra",
    "URL": "/images/Influencer-Campaign/BrandLogos/KBM_rxeoq7.png",
    "PageURL": "khana-banaye-mazedaar",
    "BrandURL": "kbm-spices"
  },
  {
    "id": 68,
    "BrandName": "VUSPORT",
    "CampaignTitle": "Experience Sports Like Never Before!",
    "CampaignVideo": "https://www.youtube.com/watch?v=pxzjKz1-SsM",
    "Objective": "The objective of VUSPORT is to establish itself as the leading platform for sports analytics, streaming, and content, providing a unique and engaging experience for sports fans. By signing AB De Villiers and Sunil Chhetri as brand ambassadors, the brand aims to leverage their popularity and credibility to create awareness, attract users, and position itself as a game-changer in the sports industry. ",
    "Strategy": "VUSPORT is backed by Super Six Sports Gaming (SSSG), the parent company of Fantasy Akhada, a well-known Daily Fantasy Sports App. With a strong focus on technology and data sciences, VUSPORT aims to differentiate itself by providing high-quality data insights and seamless user experiences.The brand's launch on social media platforms such as YouTube, Instagram, and Twitter ensures maximum reach and engagement with the target audience. Through compelling content and regular updates, VUSPORT aims to capture the attention of hardcore sports fans and position itself as the go-to platform for sports analytics.",
    "InfluencersInvolved": "AB De Villiers, Sunil Chhetri",
    "IndustryType": "Gaming",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "28 Mar 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/chetrisunil11, https://app.qoruz.com/profile/abdevilliers17_1",
    "URL": "/images/Influencer-Campaign/BrandLogos/VUSPORT_kdsfqv.jpg",
    "PageURL": "experience-sports-like-never-before",
    "BrandURL": "kvusport"
  },
  {
    "id": 69,
    "BrandName": "CEAT Ltd",
    "CampaignTitle": "For The Game Called Road",
    "CampaignVideo": "https://www.youtube.com/watch?v=T6y_IKrtsIE",
    "Objective": "The objective of CEAT's TVC is to emphasize the brand's commitment to making mobility safer and smarter, while paying tribute to the sport of cricket and connecting with its passionate fanbase.",
    "Strategy": "The strategy behind the TVC is to showcase the parallel between the challenges faced by Harmanpreet Kaur as a rider on the road and the challenges faced in the game of cricket. By highlighting how Harmanpreet overcomes these obstacles with the help of CEAT's two-wheeler tyres, the TVC aims to communicate the importance of safety and reliability in mobility. The TVC also aims to break stereotypes by showcasing a senior male coach confidently taking the pillion seat and learning from a young, talented female rider. This aligns with CEAT's intent to promote inclusivity and challenge societal norms.",
    "InfluencersInvolved": "Harmanpreet Kaur",
    "IndustryType": "Automobile",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "27 Mar 2023",
    "AgencyName": "Ogilvy",
    "QoruzProfileLink": "https://app.qoruz.com/profile/ImHarmanpreet",
    "URL": "/images/Influencer-Campaign/BrandLogos/CEAT_Ltd_b23oj9.png",
    "PageURL": "for-the-game-called-road",
    "BrandURL": "ceat-ltd"
  },
  {
    "id": 70,
    "BrandName": "7UP Nimbooz",
    "CampaignTitle": "‘Chatak Nimbooz, Gatak Nimbooz'",
    "CampaignVideo": "https://www.instagram.com/p/CqR08MAoCCK/",
    "CampaignImage": "/images/Influencer-Campaign/CampaignImages/7UP_Nimbooz.jpg_image_licwd8.jpg",
    "Objective": "The objective of PepsiCo India's new campaign for 7UP Nimbooz is to position it as a refreshing and rejuvenating drink, particularly suited for the hot summer season. The campaign aims to reinforce the brand's superior taste offering and capture the essence of 'freshness in a bottle'.\n\nStrategy: The strategy behind the campaign is to leverage the enduring love for nimbu pani (lemonade) in India and present 7UP Nimbooz as a modern and convenient alternative to traditional homemade nimbu pani. By highlighting its sparkling lemon and lime flavor, the campaign aims to establish Nimbooz as the perfect refresher for the summer season. The campaign features actress Mithila Palkar, who embodies the spirit of freshness and brings a relatable and youthful appeal to the brand. The creative execution of 'Chatak Nimbooz, Gatak Nimbooz' captures the idea of experiencing the cool and rejuvenating sensation of Nimbooz in a visually appealing manner. To amplify the campaign's reach, PepsiCo India plans to implement a 360-degree surround strategy, utilizing television, digital platforms, outdoor advertising, and social media. This comprehensive approach ensures that the message of Nimbooz as a refreshing drink reaches a wide audience across various channels.",
    "InfluencersInvolved": "Mithila Palkar",
    "IndustryType": "Food & Beverages",
    "AssetType": "Video",
    "SocialPlatforms": "Instagram",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "27 Mar 2023",
    "AgencyName": "Leo Burnett",
    "QoruzProfileLink": "https://app.qoruz.com/profile/mipalkarofficial",
    "URL": "/images/Influencer-Campaign/BrandLogos/7UP_Nimbooz_xpzx9c.jpg",
    "PageURL": "chatak-nimbooz-gatak-nimbooz",
    "BrandURL": "7up-nimbooz"
  },
  {
    "id": 71,
    "BrandName": "Havmor Ice Cream",
    "CampaignTitle": " ‘It’s that good’",
    "CampaignVideo": "https://www.youtube.com/watch?v=YEq_Oeb26qI",
    "Objective": "The objective of Havmor's summer campaign is to establish the brand's ice creams as a delightful and indulgent treat that can bring joy and happiness in any situation. The campaign aims to create a strong association between Havmor ice creams and moments of enjoyment, emphasizing the brand's quality and rich flavors.",
    "Strategy": "The strategy behind the campaign is to leverage the popularity and appeal of brand ambassador Hardik Pandya to connect with consumers and showcase the pleasure of indulging in Havmor ice creams. The tagline 'It's that good' reinforces the idea that Havmor ice creams are of superior quality, creamy, and delicious. By highlighting the ice creams' richness and the inclusion of nuts, the campaign aims to create a sensory experience and evoke a desire for the product. The goal is to create a sweet spot in the minds and hearts of consumers across the country, positioning Havmor as the go-to ice cream brand for moments of happiness and indulgence. The association with the legacy of Havmor as a top ice cream brand from Gujarat adds to the brand's credibility and heritage.",
    "InfluencersInvolved": "Hardik Pandya",
    "IndustryType": "Food & Beverages",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "23 Mar 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/hardikpandya93",
    "URL": "/images/Influencer-Campaign/BrandLogos/Havmor_Ice_Cream_kv2l4i.png",
    "PageURL": "its-that-good",
    "BrandURL": "havmor-ice-cream"
  },
  {
    "id": 72,
    "BrandName": "Schwarzkopf Professional",
    "CampaignTitle": "Together, A passion for hair",
    "CampaignVideo": "https://www.instagram.com/p/CqDWgnBgwj8/",
    "CampaignImage": "/images/Influencer-Campaign/CampaignImages/Mira-Kapoor-embraces-clean-beauty-in-chwarzkopf-professionals-campaign_yqq632.jpg",
    "Objective": " The objective of Schwarzkopf Professional's relaunch campaign for the Bonacure range is to promote clean beauty choices in haircare and position the brand as a trustworthy and innovative option in professional haircare. The campaign aims to showcase the key attributes of the Bonacure range, including being clean, sustainable, inclusive, and utilizing advanced technology. Through the campaign, Schwarzkopf Professional aims to create brand awareness, increase product consideration, and appeal to consumers who prioritize clean and high-performing haircare products.\n\n\nStrategy: The strategy behind the campaign revolves around leveraging the influence and appeal of hair muse Mira Kapoor, known for her clean beauty choices, to resonate with the target audience. By featuring Mira Kapoor in the campaign, Schwarzkopf Professional aims to establish a connection between her admired hair and the Bonacure range, emphasizing the effectiveness and trustworthiness of the products. To execute the strategy, the campaign emphasizes the key attributes of the Bonacure range through various marketing channels, including digital platforms, social media, and traditional advertising. The messaging revolves around the benefits of using the Bonacure range for achieving clean and healthy hair, building trust and credibility among the target audience. The brand aims to capture the attention of consumers who aspire to achieve similar clean and beautiful hair, ultimately driving product adoption and brand loyalty.",
    "InfluencersInvolved": "Mira Kapoor",
    "IndustryType": "Beauty",
    "AssetType": "Video",
    "SocialPlatforms": "Instagram",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "23 Mar 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/mira.kapoor",
    "URL": "/images/Influencer-Campaign/BrandLogos/Schwarzkopf_Professional_ru3bwt.png",
    "PageURL": "together-a-passion-for-hair",
    "BrandURL": "schwarzkopf-professional"
  },
  {
    "id": 73,
    "BrandName": "Lloyd ( Havells  )",
    "CampaignTitle": "‘Khayaal jo ghar ko ghar banaye’",
    "CampaignVideo": "https://www.youtube.com/watch?v=ugnAz0h5Rcc",
    "Objective": "The objective of Havells India's campaign for the Lloyd Grande heavy-duty air conditioner range is to promote the product as an enabler of care and love at home. The campaign aims to position the Lloyd Grande range as a differentiated and reliable option in the air conditioner market, highlighting its ability to create a comfortable environment even in extreme temperatures. The objective is to deepen consumer connect, strengthen brand presence in the Northern region, and build trust and affinity for the air conditioner portfolio.",
    "Strategy": "To execute the strategy, Havells India has enlisted popular celebrities Deepika Padukone and Ranveer Singh to star in the campaign. The use of celebrity endorsements aims to create a strong impact and increase brand recall among the target audience. Deepika Padukone and Ranveer Singh, known for their on-screen chemistry and real-life relationship, bring a relatable and aspirational element to the campaign.The campaign is being promoted through a 360-degree approach, utilizing various media channels such as television, digital platforms, print, outdoor advertising, below-the-line activations, and retail visibility. The extensive media push ensures maximum reach and engagement with the target audience. The campaign aims to resonate with consumers' needs and preferences during the summer months.",
    "InfluencersInvolved": "Deepika Padukone, Ranveer Singh",
    "IndustryType": "Electronics",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Product Promotion",
    "LaunchTimelines": "23 Mar 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/deepikapadukone, https://app.qoruz.com/profile/RanveerOfficial",
    "URL": "/images/Influencer-Campaign/BrandLogos/Lloyd_Havells_jwl4gr.jpg",
    "PageURL": "khayaal-jo-ghar-ko-ghar-banaye",
    "BrandURL": "lloyd-havells"
  },
  {
    "id": 74,
    "BrandName": "Viacom18",
    "CampaignTitle": "Search Hijack'",
    "CampaignVideo": "https://www.instagram.com/reel/CqApEOiIW4c/?utm_source=ig_embed&ig_rid=25dd19ee-b09f-4dd9-8c15-19bb5fe35dca",
    "CampaignImage": "/images/Influencer-Campaign/CampaignImages/Viacom_and_Smrithi_Mandanna_qnaho2.avif",
    "Objective": " The objective of Viacom18's campaign is to disrupt the traditional naming conventions in India, where male baby names are often inspired by cricketers while female baby names are influenced by film stars. The campaign aims to encourage parents to consider women cricketers as inspirations for naming their baby girls. By promoting the names of popular women cricketers, the campaign seeks to challenge the status quo and create a trend where these names become as sought after as those of male cricketers.\n\nStrategy: The strategy behind the campaign is to leverage Google's retargeting feature to serve targeted ads to new parents. The ad features Smriti Mandhana, a prominent women cricketer, who introduces parents to the trendiest names of future stars from India's women cricket team. By using retargeting, the campaign ensures that the ad reaches parents who have shown an interest in baby names, creating a personalized and relevant messaging experience. The campaign aims to grow awareness about women cricketers and their achievements on the field, with the ultimate goal of making them household names. The campaign aligns with Viacom18's vision to develop the Women's T20 Challenge (WPL) into the world's biggest women's sporting league. By showcasing the names of women cricketers and their potential impact, the campaign aims to generate interest and support for women's cricket, further boosting the growth and popularity of the sport.",
    "InfluencersInvolved": "Smriti Mandhana",
    "IndustryType": "Entertainment",
    "AssetType": "Video",
    "SocialPlatforms": "Instagram",
    "CampaignObjective": "Awareness",
    "LaunchTimelines": "23 Mar 2023",
    "AgencyName": "22feet Tribal Worldwide.",
    "QoruzProfileLink": "https://app.qoruz.com/profile/circleofcricket.smritimandhana",
    "URL": "/images/Influencer-Campaign/BrandLogos/Viacom18_alzdzt.png",
    "PageURL": "search-hijack",
    "BrandURL": "viacom18"
  },
  {
    "id": 75,
    "BrandName": "Yoho",
    "CampaignTitle": "#NoBadMoves",
    "CampaignVideo": "https://www.instagram.com/reel/CrDPVaJo-Q0/",
    "CampaignImage": "/images/Influencer-Campaign/CampaignImages/YOHO_ye3j4w.jpg",
    "Objective": " The objective of the association between Amol Parashar and Yoho Footwear is to promote the brand's vision of making comfortable and affordable footwear accessible to all. Amol Parashar's popularity and connection with the Indian audience will be leveraged to engage with consumers and drive brand awareness. The objective is to position Yoho Footwear as a trustworthy and forward-looking brand that offers innovative, high-quality footwear options.\n\nStrategy: The strategy revolves around leveraging Amol Parashar's endorsement and resonance with the target audience to create exciting opportunities for consumer engagement. By associating him with Yoho Footwear's latest launch, the Lofos, the strategy aims to showcase the product's unique features and benefits, such as its flexibility and wrinkle-free nature. The Lofos loafers are positioned as versatile footwear that can be worn for various looks and occasions, aligning with the brand's vision of offering \"one shoe that fits all looks.\" By showcasing his positive experience with Yoho Footwear's products, specifically the Lofos, the strategy aims to generate excitement and anticipation among consumers.  The strategy aims to position Yoho as a mainstream brand that offers footwear options suitable for different lifestyles and preferences. The focus on premium leather and the promise of round-the-clock comfort align with the brand's mission to provide high-quality and versatile footwear options to a diverse range of consumers.",
    "InfluencersInvolved": "Amol Parashar",
    "IndustryType": "Fashion & lifestyle",
    "AssetType": "Video",
    "SocialPlatforms": "Instagram",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "22 Mar 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/amolparashar",
    "URL": "/images/Influencer-Campaign/BrandLogos/Yoho_mel3yh.png",
    "PageURL": "nobadmoves",
    "BrandURL": "yoho"
  },
  {
    "id": 76,
    "BrandName": "Appy Fizz",
    "CampaignTitle": "All New Appy Fizz",
    "CampaignVideo": "https://www.youtube.com/watch?v=v2LCks-JzwQ",
    "Objective": "The objective of Appy Fizz's campaign featuring brand ambassadors Kriti Sanon and Jr. NTR is to encourage consumers to embrace the new, take bold next steps, and initiate a much-needed change in their lives. The campaign aims to create a memorable and impactful brand experience while introducing the newly revamped packaging design of Appy Fizz. Additionally, the campaign seeks to reinforce consumer affinity for the brand and drive growth in the sparkling fruit-flavored category.",
    "Strategy": "The strategy revolves around leveraging the star power of Kriti Sanon and Jr. NTR to captivate and inspire consumers. By showcasing the brand ambassadors together onscreen for the first time, the campaign creates intrigue and excitement. The campaign utilizes a multi-channel approach to maximize reach and visibility. An aggressive outdoor campaign is implemented, with large impact hoardings and branding at high footfall and traffic areas. This aims to create widespread visibility and generate curiosity among consumers. Additionally, the campaign takes advantage of its association with the Indian Premier League (IPL), leveraging the tournament's massive reach and high viewership. The brand's presence during the entire run of the IPL ensures maximum exposure and engagement with the target audience.This approach goes beyond showcasing the product through advertisements and focuses on building the brand through seamless integrations within popular TV programs. This helps create a more immersive and authentic brand experience, reaching consumers during their favorite shows and enhancing brand recall.",
    "InfluencersInvolved": "Kriti Sanon, Jr. NTR",
    "IndustryType": "Food & Beverages",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "21 Mar 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/jrntr_1, https://app.qoruz.com/profile/kritisanon.__",
    "URL": "/images/Influencer-Campaign/BrandLogos/Appy_Fizz_a6m20p.png",
    "PageURL": "all-new-appy-fizz",
    "BrandURL": "appy-fizz"
  },
  {
    "id": 77,
    "BrandName": "Clear Premium",
    "CampaignTitle": "#DeshKiClearChoice",
    "CampaignVideo": "https://www.youtube.com/watch?v=wuH1UAGlZK0",
    "Objective": "The objective of Clear's collaboration with Hrithik Roshan as their brand ambassador is to draw parallels between the superstar's versatility and commitment to excellence with the brand's products. By associating with Hrithik Roshan, Clear aims to enhance its brand image, elevate itself as a leading player in the industry, and make a significant impact in the market. The objective is also to expand Clear's reach and encourage consumers to make Clear their preferred choice for quality and value-based premium packaged drinking water.",
    "Strategy": "The strategy revolves around leveraging Hrithik Roshan's immense popularity, influence, and fan base to create a strong brand association and connection with the target audience. By aligning the superstar's attributes of versatility and commitment to excellence with Clear's product offerings, the strategy aims to enhance the brand's credibility and appeal.This strategy aims to resonate with consumers who prioritize quality, health, and environmentally conscious choices. To maximize the impact of the collaboration, Clear will leverage Hrithik Roshan's star power and influence through various marketing channels. This includes advertising campaigns featuring the superstar, social media promotions, and other brand activations. The aim is to generate buzz, create brand awareness, and leverage Hrithik Roshan's reach to expand Clear's market presence.",
    "InfluencersInvolved": "Hrithik Roshan",
    "IndustryType": "",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "20 Mar 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/iHrithik",
    "URL": "/images/Influencer-Campaign/BrandLogos/Clear_Primium_water_eo0dac.png",
    "PageURL": "deshkiclearchoice",
    "BrandURL": "clear-premium"
  },
  {
    "id": 78,
    "BrandName": "Swiss Beauty",
    "CampaignTitle": "You dream it and we deliver it.",
    "CampaignVideo": "https://cdni.autocarindia.com/utils/imageresizer.ashx?n=http://img.haymarketsac.in/campaignindia/campaign-india/content/20230516105539_swisslead.png&w=800&h=520&q=70&c=1",
    "CampaignImage": "/images/Influencer-Campaign/CampaignImages/Taapsee_Pannu-_Swiss_Beauty_lxby7y.png",
    "Objective": "The objective of Swiss Beauty's collaboration with Taapsee Pannu as their brand ambassador is to redefine standards in the beauty industry and help consumers make better makeup choices. The brand aims to leverage Taapsee's influence and massive fan following to strengthen its dominance in the market and reach a wider set of audience. The objective is also to position Swiss Beauty as a go-to brand for makeup lovers, known for its long-lasting and comfortable products, and create a positive impact in the beauty industry.",
    "Strategy": "The strategy focuses on leveraging Taapsee Pannu's popularity, relatability, and influence to deepen the audience connection and drive brand awareness. Swiss Beauty and Taapsee have both risen from the ground up, which establishes a strong connection between the brand and its target audience. The strategy aims to capitalize on this connection and align Taapsee's journey with Swiss Beauty's commitment to high-performing makeup. The collaboration positions Swiss Beauty as a brand that is accessible to everyone, mirroring Taapsee's wide appeal and diverse fan base. By associating with Taapsee, who has a massive following in India, Swiss Beauty aims to expand its reach and connect with a larger consumer group that matches the brand's target audience. The aim is to create buzz, generate brand awareness, and leverage Taapsee's popularity to drive consumer engagement and loyalty.",
    "InfluencersInvolved": "Taapsee Pannu",
    "IndustryType": "Beauty",
    "AssetType": "Image",
    "SocialPlatforms": "",
    "CampaignObjective": "Brand Positioning",
    "LaunchTimelines": "16 May 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/taapsee",
    "URL": "/images/Influencer-Campaign/BrandLogos/Swiss_Beauty_achawm.png",
    "PageURL": "you-dream-it-and-we-deliver-it",
    "BrandURL": "swiss-beauty"
  },
  {
    "id": 79,
    "BrandName": "QMS MAS",
    "CampaignTitle": "You can Count on Q-Devices",
    "CampaignVideo": "https://youtu.be/qyOikAHvIjk",
    "Objective": "The objective of QMS MAS's collaboration with Kapil Dev as their brand ambassador is to reinforce the brand's core values of reliability, servicing, quality assurance, and innovation. By associating with Kapil Dev, a legendary cricketer known for his warmth, confidence, and embodiment of these virtues, the brand aims to build a strong connection with the audience and prioritize the welfare of the customers. The objective is to bring smiles to people's lives, promote a stress-free lifestyle, and contribute to the health and well-being of individuals in India.",
    "Strategy": "The strategy focuses on leveraging Kapil Dev's iconic status and relatability to connect with the audience and reinforce the brand's values. QMS MAS places the welfare of the customer above everything, and Kapil Dev's association reflects this commitment to customer satisfaction. The strategy aims to position Kapil Dev as the true embodiment of reliability, servicing, quality assurance, and innovation, which are core values of QMS MAS. By featuring Kapil Dev and the excitement among people around him, the strategy creates a sense of anticipation and eagerness to avail the convenience and benefits offered by QMS MAS. This aligns with the brand's mission of helping India become healthy and safe from diseases. The advertisement is promoted on various platforms such as digital media, OTT (over-the-top) platforms, and social media. This multi-channel approach ensures maximum reach and engagement with the target audience. By utilizing these platforms, the strategy aims to create awareness, generate buzz, and drive consumer interest in QMS MAS and its offerings.",
    "InfluencersInvolved": "Kapil Dev",
    "IndustryType": "Health & Wellness",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "17 Mar 2023",
    "AgencyName": "",
    "QoruzProfileLink": "",
    "URL": "/images/Influencer-Campaign/BrandLogos/QMS_he9buc.jpg",
    "PageURL": "you-can-count-on-q-devices",
    "BrandURL": "qas-mas"
  },
  {
    "id": 80,
    "BrandName": "Gillette Venus",
    "CampaignTitle": " ‘Ooohhh without the Ouch’",
    "CampaignVideo": "https://www.youtube.com/watch?v=a6l7YdOTrKQ",
    "Objective": "The objective of Gillette Venus' latest TVC campaign is to promote their new product, Simply Venus, as a pain-free and comfortable hair removal option for women. The campaign aims to highlight the product's features, such as the glidestrip and specially designed head, which contribute to a smooth and painless hair removal experience. The objective is to encourage women to choose pain-free smoothness and feel good and confident in their own skin.",
    "Strategy": "The strategy focuses on positioning Gillette Venus as a brand that prioritizes the comfort and well-being of women during the hair removal process. The campaign's messaging revolves around the concept of 'Ooh without the Ouch,' emphasizing the painless and hassle-free nature of using Simply Venus. The strategy aims to address the common concern of discomfort and make the hair removal experience more enjoyable for women. The strategy revolves around promoting the pain-free and comfortable hair removal experience offered by Gillette Venus' Simply Venus razor. By highlighting the product's features and benefits, the brand aims to attract women seeking a hassle-free and gentle hair removal solution. The objective is to create awareness and preference for Gillette Venus as the go-to brand for achieving smooth and beautiful skin without enduring pain or discomfort.",
    "InfluencersInvolved": " Ananya Pandey",
    "IndustryType": "Beauty",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Increase Sales",
    "LaunchTimelines": "16 May 2023",
    "AgencyName": "Grey India",
    "QoruzProfileLink": "https://app.qoruz.com/profile/ananyapanday",
    "URL": "/images/Influencer-Campaign/BrandLogos/Gillette_Venus_reoaiq.png",
    "PageURL": "ooohhh-without-the-ouch",
    "BrandURL": "gillette-venus"
  },
  {
    "id": 81,
    "BrandName": "RENÉE Cosmetics",
    "CampaignTitle": "Long-lasting and Premium Perfume",
    "CampaignVideo": "https://www.youtube.com/watch?v=aax5fZhuHXU",
    "Objective": "The objective of RENÉE Cosmetics' collaboration with Janhvi Kapoor as the face of their fragrance category is to leverage her popularity and appeal to attract and engage their target audience. By associating with Janhvi Kapoor, RENÉE Cosmetics aims to increase brand recognition, generate adulation from consumers, and establish a strong presence in the fragrance market. The launch of three versatile fragrances, namely Bloom, Dark Desire, and OUD Aspire, is part of the objective to expand their fragrance portfolio and offer high-quality perfumes for various occasions and gifting purposes.",
    "Strategy": "The strategy revolves around leveraging Janhvi Kapoor's infectious energy, effervescence, and popularity to create a strong brand connection with the target audience. RENÉE Cosmetics recognizes Janhvi Kapoor's appeal and believes that her endorsement will resonate well with their consumers. The strategy aims to capitalize on her influence and attract more attention and adulation for the brand's fragrance category. The strategy focuses on leveraging Janhvi Kapoor's popularity, launching versatile and luxurious fragrances, and emphasizing constant product innovation to expand RENÉE Cosmetics' fragrance portfolio. The objective is to enhance brand recognition, generate adulation from consumers, and establish a strong foothold in the fragrance market, ultimately driving growth and success for RENÉE Cosmetics.",
    "InfluencersInvolved": "Janhvi Kapoor",
    "IndustryType": "Beauty",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Recognition",
    "LaunchTimelines": "10 Mar 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/janhvikapoor",
    "URL": "/images/Influencer-Campaign/BrandLogos/REN%C3%89E_Cosmetics_soucl1.png",
    "PageURL": "long-lasting-and-premium-perfume",
    "BrandURL": "renee-cosmetics"
  },
  {
    "id": 82,
    "BrandName": "ITC Vivel",
    "CampaignTitle": " #AncientBeautySecrets",
    "CampaignVideo": "https://www.youtube.com/watch?v=-9zxoRMWQ4Q",
    "Objective": "The objective of ITC Vivel's launch of the Vivel VedVidya premium range of bathing bars is to celebrate ancient beauty ingredients and experiences while showcasing the unique product attributes and benefits of radiant and soft skin. By partnering with Sharmila Tagore, a renowned and timeless beauty icon, the brand aims to create a new and modern perspective on beauty that combines technology with ancient beauty rituals. The objective is to position Vivel VedVidya as a brand that offers a unique blend of tradition and innovation, appealing to consumers who value both heritage and modernity in their beauty routines.",
    "Strategy": "The strategy focuses on leveraging the reputation and timeless beauty of Sharmila Tagore to endorse the Vivel VedVidya range and bring to life the proposition of beauty in an innovative and never-before-seen manner. The introduction of a digitally created avatar of Sharmila Tagore's younger self adds a touch of nostalgia and intrigue to the campaign, highlighting the brand's use of technology to retell the story of ancient beauty in a relevant and contemporary way.  By combining the knowledge of ancient beauty rituals with modern ingredients and advancements, the brand aims to present a unique and compelling narrative of timeless beauty. The strategy emphasizes the brand's commitment to remaining relevant in the beauty space by leveraging the concept of 'old is gold' and infusing it with modern-day values. The strategy aims to evoke a sense of nostalgia and admiration for the traditional beauty rituals while presenting them in a contemporary and relatable manner. The objective is to present a new perspective on beauty, create an indelible experience of ancient beauty rituals, and establish Vivel VedVidya as a brand that resonates with consumers seeking a balance between heritage and modernity in their beauty journeys.",
    "InfluencersInvolved": "Sharmila Tagore",
    "IndustryType": "Beauty",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "7 Mar 2023",
    "AgencyName": "",
    "QoruzProfileLink": "",
    "URL": "/images/Influencer-Campaign/BrandLogos/ITC_Vivel_ehmhtf.png",
    "PageURL": "ancientbeautysecrets",
    "BrandURL": "itc-vivel"
  },
  {
    "id": 83,
    "BrandName": "Kurkure",
    "CampaignTitle": "#AbLagaMasala",
    "CampaignVideo": "https://www.instagram.com/p/CpSFNInIiR6/",
    "CampaignImage": "/images/Influencer-Campaign/CampaignImages/Sara_ali_khan_tgzvcr.webp",
    "Objective": " The objective of Kurkure's collaboration with Sara Ali Khan as its brand ambassador is to increase brand reach, amplify the brand's quirky messaging, and enhance audience engagement. The partnership aims to leverage Sara's expressive and entertaining persona to personify the Kurkure personality and create a strong connection with the target audience. By featuring Sara in upcoming campaigns and promoting the brand across traditional and digital platforms, the objective is to enhance brand visibility, drive consumer interest, and ultimately increase sales and market share.\n\nStrategy: The strategy revolves around capitalizing on Sara Ali Khan's popularity and natural charm to resonate with the target audience and strengthen Kurkure's brand image. By highlighting Sara's exuberance and cheerfulness, the brand aims to align itself with her vibrant personality, emphasizing the fun and enjoyment associated with consuming Kurkure snacks. The strategy focuses on showcasing Sara as a perfect fit for Kurkure's masaledaar family, creating a sense of relatability and likeability among consumers. The brand will leverage Sara's presence on social media platforms, such as Instagram, to engage with her large and dedicated fan base. The entertaining Instagram reel, featuring Sara in her natural element, serves as an effective teaser to generate excitement and curiosity among her followers. The strategy aims to capitalize on the reel's initial success and build momentum for future campaigns.The strategy for Kurkure's collaboration with Sara Ali Khan revolves around leveraging her expressive and entertaining persona, amplifying the brand's quirky messaging, and creating a strong brand presence across traditional and digital platforms. The objective is to increase brand visibility, resonate with the target audience, and ultimately drive consumer engagement and sales.",
    "InfluencersInvolved": "Sara Ali Khan",
    "IndustryType": "Food",
    "AssetType": "Video",
    "SocialPlatforms": "Instagram",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "2 Mar 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/iSaraAliKhan",
    "URL": "/images/Influencer-Campaign/BrandLogos/Kurkure_teeqhv.jpg",
    "PageURL": "ablagamasala",
    "BrandURL": "kurkure"
  },
  {
    "id": 84,
    "BrandName": "Huggies",
    "CampaignTitle": "#HuggiesFlipAndDipChallenge",
    "CampaignVideo": "https://www.youtube.com/watch?v=X88sBtZ-pbw",
    "Objective": "The objective of Huggies' #HuggiesFlipAndDipChallenge campaign is to demonstrate the superiority of Huggies' high-quality baby care products using innovative technologies. The campaign aims to engage consumers and allow them to experience the brand's superiority firsthand through the challenge. It also seeks to leverage the influence of Sonam Kapoor, a prominent celebrity influencer for young women and moms, to reach a wider audience and reinforce Huggies' position as a trusted brand in the baby care industry.",
    "Strategy": "The strategy for the #HuggiesFlipAndDipChallenge campaign involves a 360° marketing approach that encompasses digital platforms, TV, in-store, and outdoor advertising. The campaign starts with a creative digital film featuring babies as advocates for the brand's new range, establishing a connection with the target audience. The subsequent launch of a film featuring Sonam Kapoor taking up the challenge aims to amplify the campaign's reach and generate interest among consumers. Select mom influencers will also be encouraged to participate in the challenge, further showcasing the brand's superiority to a larger audience. The campaign will be deployed in multiple languages to cater to diverse segments of the population. Additionally, Huggies plans to promote the challenge extensively in various Indian cities, leveraging both in-store and outdoor advertising to maximize visibility and engagement.",
    "InfluencersInvolved": "Sonam Kapoor Ahuja",
    "IndustryType": "Baby Care",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "2 Mar 2023",
    "AgencyName": "Ogilvy",
    "QoruzProfileLink": "https://app.qoruz.com/profile/sonamakapoor",
    "URL": "/images/Influencer-Campaign/BrandLogos/Huggies_b33ufm.png",
    "PageURL": "huggiesflipanddipchallenge",
    "BrandURL": "huggies"
  },
  {
    "id": 85,
    "BrandName": "The Indian Garage Co.",
    "CampaignTitle": "Pick your style soon!",
    "CampaignVideo": "https://gumlet.assettype.com/afaqs%2F2023-03%2F016f5c4e-65b8-495f-bcd2-78b5d04e1374%2FSKY_TIGC_2.jpeg?rect=0%2C88%2C1067%2C600&format=webp&w=700&dpr=1.3",
    "CampaignImage": "/images/Influencer-Campaign/CampaignImages/Pick_your_style_soon_ncoh0z.png",
    "Objective": "The objective of The India Garage Co.'s digital campaigns is to increase brand visibility, drive engagement, and establish itself as a top fashion choice among Indian youth. By leveraging the popularity and endorsement of cricketer Suryakumar Yadav (SKY), the brand aims to position itself as an innovative, fearless, bold, and creative fashion brand. The launch of a new range of casual apparel lines, targeting the digital-first fashion market in India, further supports the objective of expanding the brand's presence and appeal to the youth demographic.",
    "Strategy": "The strategy for The India Garage Co.'s digital campaigns involves leveraging the association with Suryakumar Yadav as the brand ambassador. SKY's popularity and vivacious personality resonate with the brand's values of innovation, fearlessness, boldness, and creativity. The brand will showcase the all-new range of casual apparel lines, including oversized t-shirts, casual shirts, sweaters, shorts, hoodies, jackets, chinos, denim, and sweatshirts, through digital platforms and campaigns. This includes social media channels, influencer collaborations, and engaging content that appeals to the target audience. The campaigns will focus on highlighting the brand's unique style, quality, and fashion-forward approach, aiming to capture the attention of Indian youth who prioritize digital-first fashion choices. By establishing a significant association with SKY and showcasing the new apparel range, The India Garage Co. aims to position itself as a top fashion brand in the digital space, driving brand recognition, engagement, and ultimately increasing its market share among Indian youth.",
    "InfluencersInvolved": "Suryakumar Yadav",
    "IndustryType": "Fashion",
    "AssetType": "Image",
    "SocialPlatforms": "",
    "CampaignObjective": "Drive Engagement",
    "LaunchTimelines": "1 Mar 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/surya_14kumar_1",
    "URL": "/images/Influencer-Campaign/BrandLogos/The_Indian_Garage_Co._kfe9ud.png",
    "PageURL": "pick-your-style-soon",
    "BrandURL": "the-indian-garage-co"
  },
  {
    "id": 86,
    "BrandName": "Wellbeing Nutrition",
    "CampaignTitle": "#StartWithin",
    "CampaignVideo": "https://www.youtube.com/watch?v=nEJKkPeZFPw",
    "Objective": "The objective of Wellbeing Nutrition's digital ad campaign is to showcase their wide range of products and educate consumers about the technology behind their melts range. By featuring Dulquer Salmaan, a popular actor known for his strong passion, the brand aims to enhance its brand positioning and create a positive impact on consumers' perception of the brand. The objective is to increase awareness, generate interest, and build trust among the target audience.",
    "Strategy": "The strategy for Wellbeing Nutrition's digital ad campaign revolves around effective storytelling and education. The ad film, directed by Rohit Reddy, focuses on explaining the technology behind the melts range in a way that is easily understandable for consumers. By using patented nano technology to convert plant-based ingredients into nanoparticles, the brand highlights the advanced science and innovation behind their products. This strategy aims to position Wellbeing Nutrition as a trusted and technologically advanced nutraceutical brand. The choice of Dulquer Salmaan as the brand ambassador adds credibility and relatability, leveraging his strong passion and influence in the South Indian film industry. The digital ad campaign will be distributed across various social media platforms and OTT platforms, maximizing the reach and engagement with the target audience. Through effective storytelling, education, and the association with a popular actor, Wellbeing Nutrition's strategy aims to capture the attention of consumers, drive brand awareness, and establish the brand as a leader in the nutraceutical industry.",
    "InfluencersInvolved": "Dulquer Salmaan",
    "IndustryType": "Health & Wellness",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Positioning",
    "LaunchTimelines": "27 Feb 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/dulQuer",
    "URL": "/images/Influencer-Campaign/BrandLogos/Wellbeing_Nutrition_bn7brl.png",
    "PageURL": "startwithin",
    "BrandURL": "wellbeing-nutrition"
  },
  {
    "id": 87,
    "BrandName": "Orange Health Labs",
    "CampaignTitle": "#FresherBloodAccurateReports",
    "CampaignVideo": "https://youtu.be/l6bJkw3AJ4k",
    "Objective": "The objective of Orange Health Labs' 360-degree campaign is to raise awareness about the impact of blood freshness on test accuracy in the healthcare industry. The campaign aims to highlight the unique offerings of Orange Health Labs, including home sample collection, rapid testing, elimination of batch testing, and 100% accurate results. By featuring Ayushmann Khurrana as the brand ambassador, the objective is to associate the brand with modern and logical choices and create a strong brand identity in the minds of consumers.",
    "Strategy": "The strategy for Orange Health Labs' campaign revolves around education, convenience, and credibility. The campaign aims to educate consumers about the importance of blood freshness in test accuracy, emphasizing the need for on-demand at-home collections to ensure accurate results. The unique offerings of Orange Health Labs, such as rapid testing and elimination of batch testing, will be highlighted to showcase the brand's commitment to providing accurate and convenient healthcare solutions. By featuring Ayushmann Khurrana as the brand ambassador, the campaign aims to leverage his popularity and credibility to connect with the target audience. Ayushmann represents modern and logical choices through his work, aligning with Orange Health Labs' focus on innovation and convenience. The association with Ayushmann will help in building brand trust and establishing Orange Health Labs as a reliable and forward-thinking health-tech start-up.The 360-degree campaign will include various channels such as television, digital platforms, print media, and social media.",
    "InfluencersInvolved": "Ayushmann Khurrana",
    "IndustryType": "Health & Wellness",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Positioning",
    "LaunchTimelines": "17 May 2023",
    "AgencyName": "DENTSU CREATIVE India",
    "QoruzProfileLink": "https://app.qoruz.com/profile/ayushmannk",
    "URL": "/images/Influencer-Campaign/BrandLogos/Orange_Health_LabsV_yevy2r.png",
    "PageURL": "fresherbloodaccuratereports",
    "BrandURL": "orange-health-labs"
  },
  {
    "id": 88,
    "BrandName": " Lotus Organics+",
    "CampaignTitle": "#ProtectYourSkinsNaturalGlow",
    "CampaignVideo": "https://www.youtube.com/watch?v=Mgnxb1MGn1A",
    "Objective": "The objective of the digital campaign for Lotus Organics+ Suncare range featuring Dia Mirza is to create awareness and promote the benefits of the brand's mineral-based sunscreens. The campaign aims to target a youthful audience of millennials and Gen Z who are conscious about using organic beauty products and are concerned about protecting their skin from sun-induced damage. The campaign also aims to leverage Dia Mirza's large fan base to increase brand visibility and engage with the audience on social media platforms and OTT channels.",
    "Strategy": "The strategy for the campaign revolves around leveraging Dia Mirza's influence and credibility as a brand ambassador to promote the Lotus Organics+ Suncare range. The campaign will primarily run on social media platforms, including Dia Mirza's own channels, such as Facebook, Instagram, and YouTube, to attract maximum visibility and engagement. The messaging of the campaign will revolve around the importance of using organic and environmentally-friendly products for skincare, aligning with the concerns of the target audience. The campaign will utilize high-quality visuals, engaging storytelling, and Dia Mirza's persona to create a strong impact and resonate with the audience. The aim is to educate and empower the audience to make informed choices about their skincare routine and promote the benefits of using mineral-based sunscreens for skin protection. Additionally, the campaign will be extended to leading OTT platforms to reach a wider audience and maximize the brand's visibility. The high-decibel digital campaign will leverage the power of social media and OTT platforms to connect with the target audience, generate interest, and drive engagement.",
    "InfluencersInvolved": "Dia Mirza ",
    "IndustryType": "Beauty",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "17 May 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/deespeak",
    "URL": "/images/Influencer-Campaign/BrandLogos/Lotus_Organics_zmfzeq.png",
    "PageURL": "protectyourskinsnaturalglow",
    "BrandURL": "lotus-organics+"
  },
  {
    "id": 89,
    "BrandName": "Goibibo",
    "CampaignTitle": "#SabkaYaarDegaHazaar",
    "CampaignVideo": "https://www.youtube.com/watch?v=5gv_uAupEW4",
    "Objective": "The objective of Goibibo's campaign, #SabkaYaarDegaHazaar, is to provide a solution to a common frustration experienced by customers when it comes to availing discounts in the hotel booking process. The campaign aims to offer a flat discount of 1000 to first-time customers, adding real value and addressing the customers' desire for straightforward and attractive offers. The objective is to attract new customers and drive bookings by presenting a refreshing departure from the traditional percentage-based discounts.",
    "Strategy": "The strategy for the campaign revolves around simplicity, value, and customer engagement. The campaign focuses on offering a flat discount of 1000 to first-time customers, which is communicated as a clear and tangible benefit. This approach aims to differentiate Goibibo from competitors who typically offer percentage-based discounts that can be perceived as less impactful. The campaign leverages digital platforms to reach and engage with the target audience effectively. It features leading social media stars Prajakta Kohli, Vihan Samat, and Sanjana Sarathy in a digital film, which adds relatability and appeal to the campaign. The use of social media influencers helps to generate buzz, attract attention, and create a connection with the younger demographic.The strategy aims to attract new customers, increase bookings, and position Goibibo as a customer-centric brand that offers real value through its attractive discount. The campaign leverages digital platforms, relatable influencers, and a clear and simple messaging approach to engage with the target audience effectively and drive conversions.",
    "InfluencersInvolved": "Prajakta Kohli, Vihan Samat, Sanjana Sarathy",
    "IndustryType": "Travel",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "17 May 2023",
    "AgencyName": "MagicCircle Communications",
    "QoruzProfileLink": "https://app.qoruz.com/profile/iamMostlySane, https://app.qoruz.com/profile/vihaansamat, ",
    "URL": "/images/Influencer-Campaign/BrandLogos/Goibibo_uqu6ol.png",
    "PageURL": "sabkayaardegahazaar",
    "BrandURL": "goibibo"
  },
  {
    "id": 90,
    "BrandName": "JACK&JONES",
    "CampaignTitle": "#DONTHOLDBACK3.0",
    "CampaignVideo": "https://www.youtube.com/watch?v=61NCj7gxal8",
    "Objective": "The objective of the DON'T HOLD BACK 3.0 campaign by JACK & JONES, featuring Bollywood superstar Ranveer Singh, is to break the rules of fashion and elevate the brand's positioning during the festive season. The campaign aims to showcase edgy and contemporary streetstyle looks that align with the brand's essence of being bold and fearless. By partnering with Ranveer Singh, who is known for his trendsetting style and energetic persona, the objective is to generate excitement, capture attention, and reinforce JACK & JONES as a leading fashion brand.",
    "Strategy": "The strategy for the DON'T HOLD BACK 3.0 campaign revolves around leveraging the star power, trendsetting image, and fashion icon status of Ranveer Singh to create a high-octane and impactful campaign. By teaming up with the country's biggest superstar, JACK & JONES aims to attract attention and engage with its target audience.The use of a campaign film helps to create a visually captivating experience and communicate the brand's message effectively. This strategy aims to captivate the audience and create a strong association between Ranveer Singh and JACK & JONES, positioning the brand as a trendsetter. The objective is to strengthen JACK & JONES' positioning as a fashion-forward brand that encourages individuals to break the rules and express themselves boldly through their style choices.By introducing the third video of the #DONTHOLDBACK campaign, the strategy seeks to build on the success and popularity of the previous campaign iterations.",
    "InfluencersInvolved": "Ranveer Singh",
    "IndustryType": "Fashion",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Positioning",
    "LaunchTimelines": "6 Oct 2022",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/RanveerOfficial",
    "URL": "/images/Influencer-Campaign/BrandLogos/JACK_JONES_yt6uxn.png",
    "PageURL": "donotholdback3.0",
    "BrandURL": "jack&jones"
  },
  {
    "id": 91,
    "BrandName": "India Gate Foods",
    "CampaignTitle": "“Basmati Rice Se No Compromise” ",
    "CampaignVideo": "https://www.youtube.com/watch?v=ePDZpW5lFqQ",
    "Objective": "The objective of the 'Basmati Rice Se No Compromise' campaign by India Gate Foods is to drive consumers to switch from loose (unbranded) basmati rice to the branded basmati rice category. The campaign aims to highlight the importance of not compromising on the quality of basmati rice, positioning it as a staple that makes everyday meals special. By emphasizing the message of no compromise, the objective is to create awareness and encourage consumers to choose India Gate Foods' branded basmati rice over unbranded alternatives.",
    "Strategy": "The strategy for the 'Basmati Rice Se No Compromise' campaign revolves around leveraging the influence and appeal of Pankaj Tripathi, a renowned actor known for his connection with Hindi-speaking markets. By featuring Pankaj Tripathi in the commercials, the campaign aims to effectively communicate the message of not compromising on the quality of basmati rice. This strategy aims to create a sense of value and importance around basmati rice, positioning it as a premium choice that enhances everyday meals. To reach a wide audience, the campaign has been launched on more than 40 TV channels, digital platforms, and social media. This multi-market brand campaign ensures maximum visibility and engagement with consumers across various touchpoints. The strategy aims to leverage the emotional appeal, influence of Pankaj Tripathi, and the brand's reputation as the world's No. 1 packaged basmati rice to drive consumer preference for India Gate Foods' branded basmati rice. ",
    "InfluencersInvolved": "Pankaj Tripathi",
    "IndustryType": "Food & Beverages",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "7 Jan 2023",
    "AgencyName": "CreativelandAsia",
    "QoruzProfileLink": "https://app.qoruz.com/profile/TripathiiPankaj",
    "URL": "/images/Influencer-Campaign/BrandLogos/India_Gate_Foods_tlknyb.png",
    "PageURL": "basmati-rice-se-no-compromise",
    "BrandURL": "india-gate-foods"
  },
  {
    "id": 93,
    "BrandName": "TVS Radeon",
    "CampaignTitle": " “Samajhdar ko ishara hi kafi hain” ",
    "CampaignVideo": "https://www.youtube.com/watch?v=_fDTA-iCtKY",
    "Objective": "The objective of the TVS Radeon campaign is to highlight the new features of the latest variant of the motorcycle and emphasize the comfort, convenience, and fuel efficiency it offers for everyday commuting. The campaign aims to generate consumer interest and create a strong brand recall for TVS Radeon.",
    "Strategy": "The strategy for the TVS Radeon campaign revolves around the use of a popular celebrity, Pankaj Tripathi, to deliver the brand's message through gestures and minimal dialogues. By leveraging Pankaj Tripathi's acting style and popularity, the campaign aims to engage the audience and create intrigue around the features of the motorcycle.The advantages of these features are demonstrated through Pankaj Tripathi's actions in a humorous and engaging manner. The use of subtle humor adds an entertaining element to the campaign, making it more memorable for the audience. This approach aims to create a sense of confidence in the product and highlight its unique features.By showcasing the benefits of the new variant and delivering the brand's message in an entertaining and engaging manner, the campaign aims to generate interest among consumers, increase brand recall, and ultimately drive sales of TVS Radeon motorcycles.",
    "InfluencersInvolved": "Pankaj Tripathi",
    "IndustryType": "Automobile",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Highlight Features",
    "LaunchTimelines": "11 Jul 2022",
    "AgencyName": "Lowe Lintas",
    "QoruzProfileLink": "https://app.qoruz.com/profile/TripathiiPankaj",
    "URL": "/images/Influencer-Campaign/BrandLogos/TVS_Radeon_vi86m2.png",
    "PageURL": "samajhdar-ko-ishara-hi-kafi-hain",
    "BrandURL": "tvs-radeon"
  },
  {
    "id": 94,
    "BrandName": "ManipalCigna Health Insurance",
    "CampaignTitle": "“Expert Ki Suno Sahi Chuno” ",
    "CampaignVideo": "https://www.youtube.com/watch?v=tNav-678znY",
    "Objective": "The objective of the ManipalCigna Health Insurance campaign is to promote the brand's fully-loaded health insurance products in a light-hearted and humorous way. The campaign aims to break the monotony of traditional health insurance advertisements and create engaging, relatable, and memorable content for the viewers. The goal is to encourage the audience to consider buying the right health insurance plan from ManipalCigna, positioning the brand as an expert in the field.",
    "Strategy": "The strategy for the ManipalCigna Health Insurance campaign involves the use of brand ambassador Manoj Bajpayee to showcase his obsession and passion for the brand's health insurance products. The aim is to leverage Manoj Bajpayee's charisma and comic timing to strike a chord with the audience and create a memorable impression. The brand films have been rolled out on all major digital platforms, News and Regional television channels, and through macro and nano influencers on Instagram. By utilizing a diverse range of influencers from various genres like Fashion, Beauty, Comics, Parenting, Automobile, Food, Dance, and Finance, the campaign aims to reach a wide audience and generate buzz and engagement. The campaign will have a multi-channel approach, extending its reach to leading General Entertainment Channels (GEC) on television for maximum outreach across the country. By taking a humorous and insight-led approach, the ManipalCigna Health Insurance campaign aims to capture the attention of the audience, differentiate itself from competitors, and encourage viewers to take the first steps towards purchasing the right health insurance plan.",
    "InfluencersInvolved": "Manoj Bajpayee",
    "IndustryType": "Food & Beverages",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "11 Jan 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/BajpayeeManoj",
    "URL": "/images/Influencer-Campaign/BrandLogos/ManipalCigna_Health_Insurance_mp9mjo.png",
    "PageURL": "expert-ki-suno-sahi-chuno",
    "BrandURL": "manipalcigna-health-insurance"
  },
  {
    "id": 95,
    "BrandName": "Navratna Active Deo Talc",
    "CampaignTitle": "Relief from Heat",
    "CampaignVideo": "https://www.youtube.com/watch?v=a2AWAUvuD5w",
    "Objective": "The objective of the Navratna Active Deo Talc campaign is to showcase the benefits of the product in the summer season and create a memorable and engaging advertisement. The campaign aims to leverage Varun Dhawan's signature fun style of acting and recreate a filmy reunion concept to capture the audience's attention. The goal is to generate positive reception, create buzz, and drive awareness and preference for Navratna Active Deo Talc.",
    "Strategy": "By leveraging Varun Dhawan's acting style and incorporating a filmy script, the campaign aims to entertain and engage the audience. The concept of a reunion with a twist adds intrigue and excitement to the narrative. The goal is to create a worthy sequel to Varun Dhawan's film Judwaa 2 and leverage his spontaneity to add fun to the advertisement. The campaign has been launched on all media channels, including social media, digital platforms, and outdoor media. The goal is to maximize reach and impact through various touchpoints. By creating a memorable and entertaining advertisement with a touch of Bollywood masala, the campaign aims to capture the audience's attention and generate positive word-of-mouth and engagement.",
    "InfluencersInvolved": "Varun Dhawan ",
    "IndustryType": "Men's Grooming",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "30 Mar 2023",
    "AgencyName": "WYP Brand Solution Private Limited",
    "QoruzProfileLink": "https://app.qoruz.com/profile/VarunDhawan.co",
    "URL": "/images/Influencer-Campaign/BrandLogos/Navratna_Active_Deo_Talc_udlbdv.jpg",
    "PageURL": "relief-from-heat",
    "BrandURL": "navratna-active-deo-talc"
  },
  {
    "id": 96,
    "BrandName": "PNB MetLife Life Insurance",
    "CampaignTitle": "“Bade Sapno Ki Tayari”",
    "CampaignVideo": "https://www.youtube.com/watch?v=CrEKiTafWsA",
    "CampaignImage": "/images/Influencer-Campaign/CampaignImages/PV_sindhu_zd9uhk.jpg",
    "Objective": "The objective of the PNB MetLife Life Insurance brand film 'Chhoti Sindhu & Friends' featuring PV Sindhu is to promote the Life Insurance Child Plan products. The ad aims to highlight the unique approach of these plans, providing parents with clarity and the means to secure their children's future and big dreams. The communication intends to be light-hearted and child-friendly to resonate with both kids and their parents, making them relate to the message. The goal is to generate awareness, engagement, and consideration for PNB MetLife Life Insurance's Child Plan offerings.",
    "Strategy": "The brand film takes a clutter-breaking approach by combining live action and animation. Featuring PV Sindhu in her animated avatar as Chhoti Sindhu, the film delivers a never-done-before concept that appeals to children and their parents. The concept of Chhoti Sindhu and her friends adds a playful and relatable element to the advertisement. The communication strategy focuses on making the serious category of insurance more approachable and engaging for the target audience. By leveraging the popularity and influence of PV Sindhu, an accomplished athlete and a role model, the campaign aims to enhance the brand's credibility and resonate with parents who aspire to secure their children's future. With the support of clients, the campaign intends to make a significant impact and create a memorable and compelling brand experience. The goal is to position PNB MetLife Life Insurance as a trusted partner for parents in securing their children's future aspirations.",
    "InfluencersInvolved": "PV Sindhu",
    "IndustryType": "Insurance",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "28 Mar 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/Pvsindhu1",
    "URL": "/images/Influencer-Campaign/BrandLogos/PNB_MetLife_Life_Insurance_vw3hrv.png",
    "PageURL": "bade-sapno-ki-tayari",
    "BrandURL": "pnb-metlife-life-insurance"
  },
  {
    "id": 97,
    "BrandName": "The Body Shop",
    "CampaignTitle": "\"changemaking beauty\"",
    "CampaignVideo": "https://www.youtube.com/watch?v=RszV2gWkYuo",
    "Objective": "The objective of The Body Shop's new communication campaign in India is to celebrate and inspire everyone to believe in their own power to effect positive change in the world. The campaign aims to showcase remarkable female changemakers who embody the brand's signature of 'changemaking beauty' and highlight the key emotional benefits The Body Shop delivers, such as self-expression, resilience, and self-love.",
    "Strategy": "1) Showcasing Remarkable Changemakers: The campaign will feature three remarkable female changemakers from diverse backgrounds who serve as inspiring examples of positive change. Their stories and experiences will be shared through a powerful campaign film to connect with the audience on an emotional level. 2) Emphasizing Individual Power: The communication campaign will highlight the belief that every individual has the power to make a difference and be a changemaker in their own way. By showcasing the stories of the changemakers, The Body Shop aims to inspire and empower people to believe in their ability to effect positive change. 3) Leveraging Multiple Platforms: The campaign will be launched across various platforms, including The Body Shop India stores and digital platforms. By utilizing both physical and digital channels, the brand aims to reach a wider audience and create meaningful engagement with customers. 4) Spreading the Message of Positive Change: Through the campaign, The Body Shop aims to shed light on the importance of positive change for individuals, communities, and the planet. The brand's commitment to creating a positive systemic impact and its efforts within the beauty culture will be highlighted, inspiring others to join the movement. 5) Rapid Expansion and Presence: With more than 200 stores in the Indian market, The Body Shop is rapidly expanding its presence. This communication campaign will further solidify the brand's commitment to embracing 'changemaking beauty' and reinforce its position as the original ethical British beauty brand.",
    "InfluencersInvolved": "Shefali Shah, Bala Devi , Anny Divya",
    "IndustryType": "Beauty",
    "AssetType": "Video",
    "SocialPlatforms": "YouTube",
    "CampaignObjective": "Brand Awareness",
    "LaunchTimelines": "18 May 2023",
    "AgencyName": "",
    "QoruzProfileLink": "https://app.qoruz.com/profile/shefalishahofficial, https://app.qoruz.com/profile/pilot_annydivya",
    "URL": "/images/Influencer-Campaign/BrandLogos/The_Body_Shop_tmfgq2.png",
    "PageURL": "changemaking-beauty",
    "BrandURL": "the-body-shop"
  }
]
